{
    "Shortsword & Shield": {
      "styleName": "Shortsword & Shield",
      "styleDescription": "A defense-focused fighting style based on historical Roman and Greek shield techniques, featuring powerful counter-attacks, tactical blocking, and defensive maneuvers that punish aggression.",
      "styleType": "Martial",
      "rangePreference": "Close Range",
      "cards": [
          {
              "id": "SS-01",
              "name": "Shield Wall",
              "subtitle": "Impenetrable Defense",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Shield Wall stance. While in this stance, reduce all damage by 2. Gain 1 Guard when you're attacked. If you have 5+ Guard, deal 1 damage to attackers automatically. You may spend X Guard to reduce damage by X.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also deal 1 damage to attackers.",
              "flavorText": "The warrior presents their shield with perfect form, creating a nearly impenetrable barrier that deflects blows while setting up devastating counters.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SS-02",
              "name": "Offensive Posture",
              "subtitle": "Shield as Weapon",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Offensive Posture stance. While in this stance, you may spend 2 Guard to increase your next attack's damage by 2. You may spend X Guard to reduce damage by X.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, immediately gain 2 Guard upon entering this stance.",
              "flavorText": "The fighter leads with the shield's edge rather than its face, using the reinforced rim as a bludgeoning weapon while maintaining some protection.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SS-03",
              "name": "Mobile Defense",
              "subtitle": "Fluid Repositioning",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Mobile Defense stance. While in this stance, after blocking damage with Guard, you may change range as a free action. You may spend X Guard to reduce damage by X.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also gain 1 Guard when changing range this way.",
              "flavorText": "Rather than absorbing blows directly, the shield bearer deflects them at angles that facilitate immediate repositioning.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SS-04",
              "name": "Shield Bash",
              "subtitle": "Stunning Strike",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 2 damage. If you have 3+ Guard, your opponent cannot play attack cards on their next turn. You may spend X Guard to deal X damage to your attacker.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also force your opponent to exit their current stance.",
              "flavorText": "A powerful thrust with the shield's face momentarily stuns the opponent, leaving them vulnerable and unable to mount an effective offense.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "SS-05",
              "name": "Swift Riposte",
              "subtitle": "Counter Strike",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Play when attacked. Reduce damage by 2 and deal 2 damage to your attacker. Gain 1 Guard. You may spend X Guard to deal X damage to your attacker.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, reduce damage by 3 instead.",
              "flavorText": "The shield absorbs the brunt of the attack while the shortsword darts out with lightning speed, exploiting the opponent's momentary vulnerability.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "SS-06",
              "name": "Blade and Barrier",
              "subtitle": "Coordinated Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 3 damage. If you're in a Defensive stance, gain 2 Guard. You may spend X Guard to reduce damage by X.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also reduce the next damage you would take by 2.",
              "flavorText": "A perfectly coordinated movement where the shield maintains protection even as the sword strikes with precision, a technique requiring years of practice.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "SS-07",
              "name": "Shield Expertise",
              "subtitle": "Technical Defense",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Guard. Your next Shortsword & Shield card costs 1 less energy to play this turn. You may spend X Guard to reduce the next X damage you would take, and deal half that amount (rounded up) back to the attacker.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also draw a card.",
              "flavorText": "Years of training manifest in subtle adjustments to shield positioning, creating maximum protection with minimal effort and setting up the next maneuver.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SS-08",
              "name": "Defensive Advance",
              "subtitle": "Protected Approach",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Change to Close Range. Gain 2 Guard and reduce all damage by 1 until your next turn. You may spend X Guard to reduce damage by X.",
              "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also draw a card when changing to Close Range.",
              "flavorText": "The warrior closes distance with shield raised, presenting minimal target area while steadily advancing into optimal striking range.",
              "rangeRestriction": "Far Range Only"
          },
          {
              "id": "SS-L1",
              "name": "Ancestral Bulwark",
              "subtitle": "Legacy Technique",
              "type": "Reaction",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Play when attacked. Completely negate the attack and gain Guard equal to the damage that would have been dealt. Deal 2 damage to your attacker.",
              "drawback": "For the rest of this turn and all of your next turn, your attacks deal 1 less damage.",
              "flavorText": "The ultimate defensive technique passed down through your bloodline diverts all incoming force, though executing such perfect form now taxes your offensive capabilities.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "SS-L2",
              "name": "Generational Counter",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal damage equal to your current Guard (minimum 2, maximum 5). This attack cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, lose all Guard and skip your draw phase next turn.",
              "flavorText": "This devastating attack channels generations of shield expertise into a single perfect strike, though executing the family technique leaves your reserves temporarily depleted.",
              "isLegacy": true,
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "SS-L3",
              "name": "Elder's Aegis",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Enter the Elder's Aegis stance. While in this stance, reduce all damage by 2 and gain 2 Guard when attacked. When you spend Guard, it's twice as effective.",
              "drawback": "While in this stance, you can only play one card per turn, and you cannot change range.",
              "flavorText": "The ultimate defensive posture passed down through your family creates near invulnerability, though maintaining such perfect form now severely limits your mobility and options.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Quarterstaff": {
      "styleName": "Quarterstaff",
      "styleDescription": "A balanced and versatile fighting style based on historical staff techniques, featuring excellent range transitions, positioning advantage, and adaptable combat strategies.",
      "styleType": "Martial",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "This style draws from various staff fighting traditions across cultures and eras, including English quarterstaff methods preserved in texts like Joseph Swetnam's 'The Schoole of the Noble and Worthy Science of Defence' (1617) and George Silver's 'Paradoxes of Defence' (1599). It also incorporates elements from Japanese bōjutsu, Chinese gun staff techniques, Portuguese jogo do pau, and French bâton techniques. Historically, the staff was one of the most common and accessible weapons, used by commoners and travelers for self-defense, making its techniques widespread and practical. The mechanics emphasize the historical quarterstaff's versatility in controlling distance and transitioning smoothly between offensive and defensive applications.",
      "cards": [
          {
              "id": "QS-01",
              "name": "High Ward",
              "subtitle": "Overhead Guard",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the High Ward stance. While in this stance, your attacks deal +1 damage. Each time you change range, gain 1 Position. While you have 4+ Position, your opponent must spend +1 energy to change range.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to force your opponent to change stance.",
              "flavorText": "The staff is held high, ready to descend with crushing force while maintaining control of the battlefield's geometry.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-02",
              "name": "Low Ward",
              "subtitle": "Grounded Defense",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Low Ward stance. While in this stance, reduce damage from attacks by 1. After reducing damage, gain 1 Position. You may spend 2 Position to change range for free. While you have 4+ Position, your opponent must spend +1 energy to change range.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to change range after reducing damage.",
              "flavorText": "The staff is held low with one end nearly touching the ground, creating a stable defense that can quickly transition to control distance.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-03",
              "name": "Middle Guard",
              "subtitle": "Centered Stance",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Middle Guard stance. While in this stance, reduce the cost of changing range by 1 (minimum 0). When you change range, gain 2 Position. While you have 4+ Position, your opponent must spend +1 energy to change range.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 3 Position to draw a card.",
              "flavorText": "The staff is held horizontally at waist height, perfectly balanced for swift transitions between advance, retreat, and lateral movement.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-04",
              "name": "Thrust Strike",
              "subtitle": "Linear Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may change range after this attack resolves. If you do, gain 2 Position.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 3 Position to make this attack deal +2 damage.",
              "flavorText": "A powerful thrusting attack with the staff's end, perfect for controlling distance while delivering significant force.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-05",
              "name": "Sweeping Strike",
              "subtitle": "Circular Attack",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 2 damage. If you have 3+ Position, this attack cannot be reduced by defensive effects. You may spend 2 Position to change range for free.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may change range after this attack resolves without spending energy.",
              "flavorText": "The staff whirls in a wide arc, striking with centrifugal force while clearing space for repositioning.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-06",
              "name": "Twist Strike",
              "subtitle": "Rotating Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Deal 1 damage at your current range, then change range and deal 1 additional damage. Gain 1 Position.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, gain 2 additional Position and draw a card.",
              "flavorText": "A complex maneuver where the staff strikes before smoothly transitioning to control distance, setting up the next attack.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-07",
              "name": "Warding Parry",
              "subtitle": "Defensive Counter",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1, then change range if desired. Gain 2 Position. You may spend 3 Position to negate the attack completely.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, also deal 1 damage to your opponent.",
              "flavorText": "The staff intercepts the incoming attack before smoothly transitioning to control the distance, turning defense into offense in a single fluid motion.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-08",
              "name": "Flow Movement",
              "subtitle": "Positional Mastery",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Position. Change range if desired. Your next Quarterstaff card costs 1 less to play this turn. While you have 5+ Position, your opponent reveals the next card they plan to play before playing it.",
              "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to enter any stance without paying its cost.",
              "flavorText": "The staff wielder moves with perfect economy of motion, each step and shift of weight creating optimal fighting distance and positioning.",
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-L1",
              "name": "Ancestral Combination",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage, change range, then deal 2 more damage. You may spend any amount of Position to add that much additional damage to the second strike.",
              "drawback": "After this attack resolves, lose all remaining Position and skip your next Focus phase.",
              "flavorText": "The perfect combination handed down through generations, a devastating sequence that few can withstand, though the strain on aging joints is evident in your follow-through.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-L2",
              "name": "Elder's Positioning",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain 5 Position immediately. Change range. Your next two Quarterstaff cards each cost 1 less to play this turn.",
              "drawback": "You cannot change stance until the end of your next turn.",
              "flavorText": "Decades of practice allow perfect positioning that transcends conscious thought, though the rapid movements now tax your weathered body's flexibility.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "QS-L3",
              "name": "Generational Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Generational Defense stance. While in this stance, reduce all damage by 1. When attacked, gain 2 Position and you may change range without spending energy.",
              "drawback": "Each time you change range while in this stance, lose 1 health.",
              "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though each swift movement now takes its toll on your battle-worn body.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Arcane Magic": {
      "styleName": "Arcane Magic",
      "styleDescription": "An adaptive, resource-conversion style focused on technical versatility and tactical adaptation, featuring mana manipulation and spell modification techniques.",
      "styleType": "Magical",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "Arcane Magic draws from scholarly magical traditions across cultures. Western influences include John Dee's 'Monas Hieroglyphica' (1564) on symbolic manipulation, Cornelius Agrippa's 'De Occulta Philosophia' (1533) which systematized magical correspondences, and the Hermetic 'Liber Mutationis' (c. 1670) detailing energy transmutation methods. Eastern sources include the Chinese 'Lingbao Wuxing' (靈寶五行, 4th century) on five-element transformations, Japanese 'Onmyōdō' texts like 'Senji Ryakketsu' (占事略決, 13th century) describing energy manipulation, and the Indian 'Siddhānta' mathematical-magical treatises that formalized pattern magic. The Mana resource mechanic parallels concepts from both Western alchemical principles of the 'quinta essentia' as described in Paracelsus' 'Archidoxis Magica' (1575) and Eastern theories of 'qi transformation' detailed in the Daoist 'Neidan' (內丹) inner alchemy texts, representing the fundamental magical energy that can be converted between different forms and applications.",
      "cards": [
          {
              "id": "AM-01",
              "name": "Arcane Focus",
              "subtitle": "Energy Concentration",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Arcane Focus stance. While in this stance, gain 1 Mana at the beginning of your turn and whenever you play a Technique card. You may convert 2 Mana to 1 energy when playing cards.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, you may convert 2 Mana into 1 energy when playing cards.",
              "flavorText": "The practitioner adopts a meditative posture with precise hand gestures, establishing optimal energy pathways to accumulate and refine magical energy for subsequent techniques.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-02",
              "name": "Arcane Assault",
              "subtitle": "Energy Projection",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Arcane Assault stance. While in this stance, you may spend 2 Mana to add 1 damage to your attacks.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, reduce the Mana cost to 1 instead of 2.",
              "flavorText": "The arcanist positions their hands in precise offensive formations, creating efficient channels for projecting concentrated magical energy with minimal dissipation.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-03",
              "name": "Mystic Displacement",
              "subtitle": "Spatial Shift",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Mystic Displacement stance. While in this stance, you may spend 2 Mana to change range as a free action once per turn.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, gain 1 Mana when you change range this way.",
              "flavorText": "Through a series of subtle gestures, the arcane practitioner manipulates local spatial properties, allowing rapid repositioning with minimal physical movement.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-04",
              "name": "Arcane Missile",
              "subtitle": "Guided Projectile",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend up to 3 Mana to add that much additional damage.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, draw a card after this attack resolves.",
              "flavorText": "A carefully formulated energy construct launches toward the target, its trajectory and intensity precisely controlled through established arcane formulas.",
              "rangeRestriction": "Far Range Only"
          },
          {
              "id": "AM-05",
              "name": "Arcane Surge",
              "subtitle": "Power Concentration",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Mana. Your next Arcane Magic card costs 1 less energy to play this turn. Choose one: Draw a card; or change stance; or change range.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, gain 5 Mana instead of 3.",
              "flavorText": "The practitioner rapidly gathers ambient magical energy through efficient collection techniques, condensing it into a stable, usable form for immediate application.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-06",
              "name": "Spell Modification",
              "subtitle": "Arcane Adaptation",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Spend 2 Mana: Choose one: Look at the top 3 cards of your deck, put one into your hand and the rest on the bottom of your deck in any order; or change the type of a card in your hand to any type until end of turn.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, look at the top 5 cards instead of 3.",
              "flavorText": "Through precise manipulation of fundamental magical principles, the arcanist adapts their prepared spells to better suit the current tactical situation.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-07",
              "name": "Counterspell",
              "subtitle": "Magical Disruption",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Play when your opponent plays a card. Spend 3 Mana: Cancel that card's effects.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, spend only 2 Mana instead of 3.",
              "flavorText": "The arcanist quickly identifies the magical structure of an incoming spell and applies precisely calculated interference patterns to collapse it harmlessly.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-08",
              "name": "Mana Conversion",
              "subtitle": "Energy Transmutation",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Spend any amount of Mana. Choose one for each Mana spent: Draw a card; or gain 1 energy; or reduce damage by 1; or deal 1 damage.",
              "masterEffect": "If you've played 2+ Arcane Magic cards this turn, also gain 1 energy for each card drawn this way.",
              "flavorText": "Through advanced energy manipulation techniques, the arcanist transforms raw magical energy into enhanced cognitive processing, accelerating tactical analysis.",
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-L1",
              "name": "Ancestral Formula",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d12",
              "effect": "Deal 2 damage. Spend any amount of Mana to add that much additional damage. This attack cannot be reduced by defensive effects or responded to with reactions.",
              "drawback": "After this attack resolves, lose all remaining Mana and take 1 damage for each 3 Mana lost this way (rounded up).",
              "flavorText": "This perfected arcane sequence passed down through generations creates an unavoidable force projection, though the complex formulae strain both mind and body as the caster's energy channels deplete.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-L2",
              "name": "Generational Insight",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain 5 Mana immediately. Look at your opponent's hand. Your next 2 Arcane Magic cards each cost 1 less energy to play. Choose one: Draw a card; or change stance; or change range.",
              "drawback": "Skip your next Focus phase. You cannot play reaction cards until your next turn.",
              "flavorText": "Drawing upon accumulated arcane knowledge of countless predecessors provides exceptional tactical clarity, though channeling such expansive cognition temporarily limits the caster's ability to gather and respond to new information.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "AM-L3",
              "name": "Arcane Mastery",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Arcane Mastery stance. While in this stance, gain 2 Mana at the beginning of your turn. Whenever you would spend Mana, spend 1 less Mana (minimum 1) and double the effect. You may convert 2 Mana to 1 energy when playing cards.",
              "drawback": "While in this stance, whenever you gain energy from Focus dice, reduce that energy by 1 (minimum 0).",
              "flavorText": "The ultimate expression of arcane efficiency perfected through generations, allowing unprecedented magical amplification through optimized energy pathways, though maintaining such precise control reduces the practitioner's ability to process raw power sources.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  }
}