{
  "Blood Magic": {
      "styleName": "Blood Magic",
      "styleDescription": "A dark, sacrifice-based fighting style focusing on converting life force into power. Features risk-reward mechanics, health manipulation, and devastating effects paid for with the caster's vitality.",
      "styleType": "Magical",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "Blood Magic draws from historical hematomancy traditions and vitalist theories documented across multiple cultures. Western influences include John Dee's obscure manuscript 'Liber Sanguinis' (c. 1580s) which detailed blood-based sympathetic magic, and Paracelsus' work on the 'vital humor' in 'Archidoxis Magica' (1575). Eastern influences include the Chinese medical text 'Huangdi Neijing' (黄帝内经, c. 200 BCE) with its detailed understanding of blood circulation and vitality, and the Tibetan 'gsang ba snying thig' (Heart Essence of the Secret) tantric practices involving vital essence manipulation. The Vitality resource mechanic reflects concepts from both the Hermetic 'ensoulment' theories documented in the 'Corpus Hermeticum' and the Japanese concept of 'ketsu-ki' (blood energy) found in medieval medical and martial texts like the 'Tenchi Happo Hoken no Maki' (天地八法宝剣之巻, c. 16th century). The sacrifice mechanics draw from both European blood covenant rituals documented in Heinrich Kramer's 'Malleus Maleficarum' (1486) and Aztec codices describing blood offerings as exchanges of power.",
      "cards": [
          {
              "id": "BM-01",
              "name": "Blood Pact",
              "subtitle": "Dark Covenant",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 1,
              "focusDie": "d10",
              "effect": "Enter the Blood Pact stance. While in this stance, you may pay 1 health instead of 1 energy when playing cards. When you deal damage, gain 1 Vitality. If your Vitality reaches 8+, lose 1 health at the end of your turn.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, immediately gain 2 Vitality upon entering this stance.",
              "flavorText": "The mage slices their palm, dark energy pulsing with each heartbeat as their wounds fuel devastating attacks.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-02",
              "name": "Sanguine Shield",
              "subtitle": "Crimson Barrier",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Sanguine Shield stance. While in this stance, you may spend 2 Vitality to prevent 3 damage from any source.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, also deal 1 damage to your opponent when you prevent damage this way.",
              "flavorText": "Blood drawn from self-inflicted wounds solidifies in mid-air, forming a crimson barrier that absorbs enemy strikes.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-03",
              "name": "Bloodmist Form",
              "subtitle": "Vaporous Escape",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Bloodmist Form stance. While in this stance, when targeted by an attack, you may lose 1 health to change range immediately.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, also gain 2 Vitality when changing range this way.",
              "flavorText": "The practitioner's body liquefies into a cloud of blood droplets, allowing them to flow between attackers and reassemble at a safer position.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-04",
              "name": "Crimson Lance",
              "subtitle": "Vitality Spear",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 2 damage. You may lose up to 3 additional health to add that much damage to this attack.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, gain Vitality equal to half the extra damage dealt (rounded up).",
              "flavorText": "The mage violently expels their own blood, which hardens into a deadly projectile—the more blood sacrificed, the larger and more devastating the weapon.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-05",
              "name": "Blood Tithe",
              "subtitle": "Life for Power",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Lose 2 health to gain 3 Vitality. Draw a card. You may spend 3 Vitality to heal 2 health.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, lose only 1 health instead.",
              "flavorText": "With practiced precision, the mage opens their veins and channels the escaping lifeblood into a swirling reservoir of power available for immediate use.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-06",
              "name": "Hemomancy",
              "subtitle": "Blood Divination",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Spend any amount of Vitality. Look at the top X cards of your deck, where X is the amount spent. Put one in your hand and the rest on the bottom of your deck in any order. You may spend 2 Vitality to heal 1 health.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, put two cards in your hand instead of one.",
              "flavorText": "Blood splashed onto the ground forms intricate patterns that reveal nearby enemies, upcoming attacks, and optimal counter-maneuvers to the trained eye.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-07",
              "name": "Life Siphon",
              "subtitle": "Vampiric Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 3 damage. Heal health equal to the damage dealt.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, also gain 2 Vitality.",
              "flavorText": "The mage's attack opens wounds that connect to their own body, creating a conduit that transfers the enemy's vitality directly into their depleted reserves.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "BM-08",
              "name": "Blood Curse",
              "subtitle": "Sacrificial Hex",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Play when your opponent plays an attack. Lose 2 health to reduce the damage by 3 and deal 2 damage to your opponent. Steal 1 Vitality from your opponent if they have any.",
              "masterEffect": "If you've played 2+ Blood Magic cards this turn, also gain 3 Vitality.",
              "flavorText": "As the enemy's attack lands, the blood mage turns their own fresh wound into a conduit for counter-magic, their pain becoming the attacker's agony.",
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-L1",
              "name": "Ancestral Sacrifice",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d12",
              "effect": "Lose 3 health. Deal 5 damage that cannot be reduced by defensive effects. Gain Vitality equal to the damage dealt.",
              "drawback": "You cannot heal or gain health from any source until the end of your next turn.",
              "flavorText": "The blood rite passed down through your lineage draws upon primal forces that even the most accomplished mages fear to touch, its power matched only by its terrible cost.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-L2",
              "name": "Generational Essence",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Immediately gain 5 Vitality. Your next Blood Magic card costs 3 less energy to play. You may spend 2 Vitality to heal 1 health. If your Vitality reaches 8+, lose 1 health at the end of your turn.",
              "drawback": "At the end of your turn, lose health equal to your unused Vitality.",
              "flavorText": "Your bloodline's accumulated power flows through your aging veins, offering immense potential that burns through your mortal frame if left unutilized.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "BM-L3",
              "name": "Hemogenic Mastery",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Hemogenic Mastery stance. While in this stance, your Blood Magic cards cost 2 less energy to play and you gain double Vitality from all sources. If your Vitality reaches 8+, lose 1 health at the end of your turn.",
              "drawback": "At the beginning of each of your turns while in this stance, lose 2 health. You cannot play any non-Blood Magic cards while in this stance.",
              "flavorText": "The ultimate blood technique perfected through generations, allowing near-limitless power at a devastating physical toll that only those with the family's unique constitution can endure.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Earth Magic": {
      "styleName": "Earth Magic",
      "styleDescription": "A defensive, territorial control style focusing on stability, endurance, and battlefield manipulation through the element of earth.",
      "styleType": "Magical",
      "rangePreference": "Close Range",
      "historicalInspiration": "Earth Magic draws from codified magical traditions in both Eastern and Western esoteric texts. Its foundations appear in Heinrich Cornelius Agrippa's 'De Occulta Philosophia' (1533) which systematized elemental correspondences, and later in Francis Barrett's 'The Magus' (1801) which detailed earth element invocations. Eastern influences include the earth-manipulation techniques found in the Chinese 'Classic of Mountains and Seas' (山海经, 4th century BCE) and Japanese Onmyōdō earth-alignment practices documented in the 'Senji Ryakketsu' (占事略決, 13th century). The stability resource mechanic mirrors concepts from the medieval alchemical text 'Splendor Solis' (1532-1535) which describes the gradual fixation of the earth element through repeated operations. While obviously fantastical, the style presents earth magic as a disciplined tradition with established techniques, stances, and methodologies that would be studied and refined by practitioners over generations, similar to how martial arts developed formal schools and transmission methods.",
      "cards": [
          {
              "id": "EM-01",
              "name": "Stone Skin",
              "subtitle": "Protective Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Stone Skin stance. While in this stance, reduce damage from attacks by 1 and gain 1 Stability after reducing damage. While you have 5+ Stability, your opponent's attacks cost +1 energy.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, also gain 1 Stability when you enter this stance.",
              "flavorText": "The mage's skin hardens to stone, each attack chipping away harmlessly as their connection to the earth deepens.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-02",
              "name": "Seismic Stance",
              "subtitle": "Aggressive Tremor",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Seismic Stance. While in this stance, spend 2 Stability: your next attack deals +2 damage this turn. While you have 3+ Stability, reduce all damage by 1. If your Stability is reduced to 0, take 1 damage.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, reduce the Stability cost to 1.",
              "flavorText": "The earth mage channels tremors through their body, each footfall sending destabilizing shockwaves toward their opponent.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-03",
              "name": "Shifting Sands",
              "subtitle": "Evasive Terrain",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Shifting Sands stance. While in this stance, when an opponent changes range, gain 2 Stability. While you have 3+ Stability, reduce all damage by 1.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, you may spend 3 Stability to change range after an opponent's attack resolves.",
              "flavorText": "The ground beneath becomes fluid and unpredictable, responsive to the mage's will while betraying the footsteps of enemies.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-04",
              "name": "Stone Spike",
              "subtitle": "Piercing Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend any amount of Stability to add that much additional damage. If your Stability is reduced to 0, take 1 damage.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, gain 2 Stability after this attack resolves.",
              "flavorText": "A jagged spear of stone erupts from the ground, its force and trajectory guided by the mage's accumulated earth energy.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-05",
              "name": "Crushing Boulder",
              "subtitle": "Heavy Impact",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Deal 3 damage. If you have 4+ Stability, this attack cannot be reduced by defensive effects.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, force your opponent to exit their current stance.",
              "flavorText": "A massive rock materializes above the opponent, its crushing weight impossible to deflect through conventional means.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "EM-06",
              "name": "Earth Wall",
              "subtitle": "Defensive Barrier",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 2 and gain 1 Stability.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, gain 2 additional Stability.",
              "flavorText": "A solid wall of stone and soil erupts from the ground, absorbing the impact of the attack while reinforcing the mage's connection to the earth.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-07",
              "name": "Quicksand Trap",
              "subtitle": "Terrain Control",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Your opponent cannot change range during their next turn. Gain 2 Stability.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, also deal 1 damage for each 3 Stability you have.",
              "flavorText": "The ground becomes treacherous and grasping, holding enemies in place while they struggle fruitlessly to escape.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-08",
              "name": "Tectonic Shift",
              "subtitle": "Ground Force",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Stability. Your next Earth Magic card costs 1 less to play this turn. If you maintain 4+ Stability until your next turn, draw a card.",
              "masterEffect": "If you've played 2+ Earth Magic cards this turn, also change range if desired.",
              "flavorText": "The earth mage realigns the very bedrock beneath their feet, channeling the ancient power of stone into their next spell.",
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-L1",
              "name": "Ancestral Mountain",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Ancestral Mountain stance. While in this stance, reduce all damage by 2 and gain 2 Stability when attacked. Spend 4 Stability: Negate an attack completely. While you have 3+ Stability, reduce all damage by 1.",
              "drawback": "While in this stance, you cannot change range and your attacks cost +1 energy.",
              "flavorText": "The perfect defensive technique passed down through generations, becoming one with the mountains themselves, though your aging body bears the weight of stone with increasing difficulty.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "EM-L2",
              "name": "Elder's Earthquake",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 4,
              "focusDie": "d12",
              "effect": "Deal 3 damage. You may spend any amount of Stability to add that much additional damage. This attack cannot be reduced by defensive effects and forces your opponent to exit their stance. If your Stability is reduced to 0, take 1 damage.",
              "drawback": "After this attack resolves, lose all remaining Stability and take 2 damage.",
              "flavorText": "The devastating earth technique refined across generations, channeling the raw power of tectonic forces, though the strain of such power tears at your weathered body.",
              "isLegacy": true,
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "EM-L3",
              "name": "Generational Resonance",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain 6 Stability immediately. All your Earth Magic cards cost 1 less energy to play until the end of your next turn.",
              "drawback": "At the end of your next turn, lose half your health (rounded down).",
              "flavorText": "The accumulated earth magic wisdom of your ancestors flows through your veins, though harnessing such primal power exacts a heavy toll on your aging frame.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Fire Magic": {
      "styleName": "Fire Magic",
      "styleDescription": "An aggressive, destructive style focused on overwhelming offense and damage over time, featuring heat building mechanics and devastating area effects that grow in power.",
      "styleType": "Magical",
      "rangePreference": "Far Range",
      "historicalInspiration": "Fire Magic draws from pyromantic traditions documented across numerous historical esoteric texts. Western influences include Heinrich Cornelius Agrippa's work on salamanders and fire elementals in 'De Occulta Philosophia' (1533), Trithemius' 'Steganographia' (c. 1500) on flame divination, and the detailed fire invocations in the 'Grimoire of Pope Honorius' (13th century). Eastern inspirations include the Taoist 'fire refinement' methods described in the 'Huang-Lao' texts (黄老, c. 2nd century BCE), Japanese 'Hi-jutsu' fire techniques documented in the 'Bansenshukai' ninja scrolls (萬川集海, 1676), and the Indian Agni Vidya practices outlined in the 'Agnipurana' (अग्निपुराण, c. 8th-11th century). The Heat resource mechanic parallels concepts found in both Western alchemical texts on the 'caloric' theory of heat as documented in Antoine Lavoisier's 'Traité Élémentaire de Chimie' (1789) and the Chinese Wu Xing theory of fire as an accumulating and transformative force described in the 'Huainanzi' (淮南子, 2nd century BCE).",
      "cards": [
          {
              "id": "FM-01",
              "name": "Conflagration Stance",
              "subtitle": "Burning Aura",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d10",
              "effect": "Enter the Conflagration Stance. While in this stance, gain 1 Heat at the beginning of your turn and whenever you play an attack card. If your Heat reaches 6+, take 1 damage at the end of your turn.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, immediately gain 2 Heat upon entering this stance.",
              "flavorText": "The pyromancer's body becomes wreathed in dancing flames, the air around them shimmering with intense heat that grows more dangerous by the moment.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-02",
              "name": "Ember Shield",
              "subtitle": "Protective Flames",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Ember Shield stance. While in this stance, when attacked, you may spend 2 Heat to deal 2 damage to your attacker. Gain 1 Heat at the beginning of your turn. If your Heat reaches 6+, take 1 damage at the end of your turn.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, reduce damage by 1 while in this stance.",
              "flavorText": "Swirling cinders orbit the mage like a living armor, lashing out to burn any who dare approach too closely.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-03",
              "name": "Smoke Form",
              "subtitle": "Ashen Escape",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Smoke Form stance. While in this stance, the first time you would take damage each turn, reduce that damage by 1 and gain 1 Heat. Gain 1 Heat at the beginning of your turn. If your Heat reaches 6+, take 1 damage at the end of your turn.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, you may change range as a free action once per turn.",
              "flavorText": "The fire mage's body partially dissipates into swirling smoke, making them difficult to strike while fueling their inner flame with each evasion.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-04",
              "name": "Fireball",
              "subtitle": "Explosive Projectile",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. This attack deals additional damage equal to half your current Heat (rounded up). You may spend up to 3 Heat to add that much additional damage to this attack.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, your opponent cannot reduce this damage with defensive effects.",
              "flavorText": "A condensed sphere of roaring flame streaks through the air before detonating with concussive force, its intensity fueled by the caster's internal heat.",
              "rangeRestriction": "Far Range preferred"
          },
          {
              "id": "FM-05",
              "name": "Burning Touch",
              "subtitle": "Lingering Flames",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage. This attack deals additional damage equal to half your current Heat (rounded up). Your opponent takes 1 additional damage at the beginning of their next turn. Gain 1 Heat.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, the lingering damage increases to 2.",
              "flavorText": "The pyromancer's touch leaves flames that cling to their opponent, hungrily consuming flesh long after the initial contact.",
              "rangeRestriction": "Close Range only"
          },
          {
              "id": "FM-06",
              "name": "Flame Surge",
              "subtitle": "Heat Release",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Spend all Heat. Deal damage equal to half the Heat spent (rounded up). Draw a card. If you spent 5+ Heat, change to your preferred range.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, deal damage equal to all Heat spent instead of half.",
              "flavorText": "The mage channels their accumulated heat into a sudden eruption of flame, the release creating space for new tactical possibilities.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-07",
              "name": "Flame Ward",
              "subtitle": "Retaliatory Barrier",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when attacked. Reduce damage by 2. For each damage prevented this way, gain 1 Heat.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, also deal 2 damage to your attacker.",
              "flavorText": "A wall of intense flame materializes just as the attack lands, absorbing the blow and converting its energy into fuel for the pyromancer's next assault.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-08",
              "name": "Kindle",
              "subtitle": "Stoke the Flames",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Heat. Your next Fire Magic card costs 1 less energy to play this turn. If your Heat is 5+, you may reduce it to 0 to deal 3 damage to your opponent.",
              "masterEffect": "If you've played 2+ Fire Magic cards this turn, also deal 1 damage to your opponent.",
              "flavorText": "The mage focuses inward, stoking their internal flame to dangerous levels in preparation for a devastating release of power.",
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-L1",
              "name": "Ancestral Inferno",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 4,
              "focusDie": "d12",
              "effect": "Deal 3 damage. This attack deals additional damage equal to half your current Heat (rounded up). Spend any amount of Heat to add that much additional damage. Your opponent takes 2 additional damage at the beginning of their next turn.",
              "drawback": "Take damage equal to half the Heat spent (rounded up). Your Heat is reduced to 0 after this attack resolves.",
              "flavorText": "The ultimate fire technique passed through your bloodline unleashes devastating power, but the strain of channeling such intense heat scorches your aging body from within.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-L2",
              "name": "Generational Pyre",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Immediately gain 5 Heat. Until the end of your next turn, your Fire Magic attacks deal +1 damage and cost 1 less energy to play.",
              "drawback": "You cannot use reactions until your next turn. At the beginning of your next turn, lose 2 health.",
              "flavorText": "Drawing upon the collective pyromantic knowledge of your ancestors creates an overwhelming surge of power that threatens to consume you from within.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "FM-L3",
              "name": "Elder's Immolation",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Elder's Immolation stance. While in this stance, gain 2 Heat at the beginning of your turn. When you deal damage, add your current Heat to the damage (up to a maximum of +5). Gain 1 Heat at the beginning of your turn. If your Heat reaches 6+, take 1 damage at the end of your turn.",
              "drawback": "At the end of each of your turns while in this stance, take damage equal to half your current Heat (rounded up).",
              "flavorText": "The culmination of generations of fire magic manifests as flames that burn with unnatural intensity, granting immense power at the cost of consuming the caster from within.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Frost Magic": {
    "styleName": "Frost Magic",
    "styleDescription": "A control-oriented, defensive fighting style focusing on restricting opponent movement and actions, featuring powerful counter-techniques and area denial.",
    "styleType": "Magical",
    "rangePreference": "Far Range",
    "historicalInspiration": "Frost Magic draws from historical winter-focused mystical traditions across multiple cultures. Western influences include Germanic and Norse frost magic beliefs documented in the Poetic Edda (particularly Snorri Sturluson's 'Gylfaginning', c. 13th century) and Icelandic grimoires like the 'Galdrabók' (c. 17th century) which contain frost and ice-control spells. Eastern traditions incorporate Japanese 'Hyōton' concepts from the 'Fūsui Unmei Kantei Shō' (風水運命鑑定書, c. 18th century) detailing weather manipulation and the Chinese 'Bīng Fǎ' (冰法) techniques described in Taoist alchemical texts from the Tang Dynasty. The style also draws from Siberian shaman practices of winter spirits as documented in the 'Tengrism' oral traditions and Russian 'Morozko' folklore. The stance-based system mirrors similar control-focused approaches in both Western and Eastern mystic traditions where practitioners create areas of influence through positioning and tactical awareness rather than accumulating specific energies.",
    "cards": [
        {
            "id": "FM-01",
            "name": "Ice Palace",
            "subtitle": "Defensive Barrier",
            "type": "Stance",
            "stanceType": "Defensive",
            "cost": 2,
            "focusDie": "d8",
            "effect": "Enter the Ice Palace stance. While in this stance, reduce damage by 1. Opponent's stance changes cost +1 energy.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, also force your opponent to spend +1 energy to change range.",
            "flavorText": "The mage conjures crystalline barriers that not only shield from harm but restrict movement with treacherous icy surfaces.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-02",
            "name": "Let It Go",
            "subtitle": "Flowing Evasion",
            "type": "Stance",
            "stanceType": "Evasive",
            "cost": 1,
            "focusDie": "d6",
            "effect": "Enter the Let It Go stance. While in this stance, when attacked, you may change range without spending energy.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, also draw a card when changing range this way.",
            "flavorText": "With a sweeping gesture, the ice mage releases control, becoming as fluid and elusive as snowflakes on the wind.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-03",
            "name": "Winter Storm",
            "subtitle": "Aggressive Flurry",
            "type": "Stance",
            "stanceType": "Aggressive",
            "cost": 2,
            "focusDie": "d8",
            "effect": "Enter the Winter Storm stance. While in this stance, your attacks cost opponent +1 energy to respond with reactions.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, your next attack also forces opponent to exit their stance.",
            "flavorText": "A howling gale of ice shards makes it nearly impossible for opponents to maintain their position or precise defenses.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-04",
            "name": "Ice Spear",
            "subtitle": "Crystalline Projectile",
            "type": "Attack",
            "cost": 3,
            "focusDie": "d10",
            "effect": "Deal 2 damage. If at Far Range, deal +1 damage. If your opponent changes stance on their next turn, deal 1 additional damage.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, this attack cannot be reduced by defensive effects.",
            "flavorText": "A perfect crystalline spear forms and launches with incredible velocity, leaving a trail of freezing air that punishes any who move through it.",
            "rangeRestriction": "Far Range preferred"
        },
        {
            "id": "FM-05",
            "name": "Frozen Heart",
            "subtitle": "Core Freeze",
            "type": "Attack",
            "cost": 2,
            "focusDie": "d8",
            "effect": "Deal 2 damage. Your opponent's next card costs +1 energy to play.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, your opponent also cannot play reactions until the end of their next turn.",
            "flavorText": "The freezing magic temporarily crystallizes the target's core, making every movement labored and painful.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-06",
            "name": "Cold Reflection",
            "subtitle": "Ice Mirror Counter",
            "type": "Reaction",
            "cost": 2,
            "focusDie": "d6",
            "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1, then deal 1 damage to your opponent.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, also prevent your opponent from changing stance until the end of their next turn.",
            "flavorText": "A mirror of perfect ice forms, reflecting the attack while sending a blast of cold back toward the attacker.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-07",
            "name": "Frozen Fractals",
            "subtitle": "Area Control",
            "type": "Technique",
            "cost": 2,
            "focusDie": "d6",
            "effect": "Until the end of your next turn, reduce all damage by 1 and your opponent's next two cards each cost +1 energy to play.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, also draw a card.",
            "flavorText": "The air itself crystallizes into beautiful, complex patterns that slow all movement through them while revealing tactical possibilities.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-08",
            "name": "The Snow Glows White",
            "subtitle": "Concealing Blizzard",
            "type": "Technique",
            "cost": 1,
            "focusDie": "d4",
            "effect": "Change range if desired. If at Far Range, your next Frost Magic card costs 2 less energy to play.",
            "masterEffect": "If you've played 2+ Frost Magic cards this turn, also change to any stance without paying its cost.",
            "flavorText": "A swirling flurry of snow obscures vision and creates distance, allowing the ice mage to reposition with perfect control.",
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-L1",
            "name": "North Mountain",
            "subtitle": "Legacy Stance",
            "type": "Stance",
            "stanceType": "Defensive",
            "cost": 3,
            "focusDie": "d10",
            "effect": "Enter the North Mountain stance. While in this stance, reduce damage by 2 and your opponent's attacks cost +1 energy.",
            "drawback": "While in this stance, your attacks cost +1 energy and you can only change range once per turn.",
            "flavorText": "The ultimate ice fortress technique passed down through generations, turning the mage into an impassable peak, though your aging body struggles to maintain mobility.",
            "isLegacy": true,
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-L2",
            "name": "Eternal Winter",
            "subtitle": "Legacy Attack",
            "type": "Attack",
            "cost": 4,
            "focusDie": "d12",
            "effect": "Deal 3 damage. Your opponent cannot change stance or range until the end of their next turn. This attack cannot be reduced by defensive effects.",
            "drawback": "After this attack resolves, skip your next Focus phase.",
            "flavorText": "The devastating frost technique perfected across generations freezes everything solid, though channeling such power drains your weathered body's reserves.",
            "isLegacy": true,
            "rangeRestriction": "Any"
        },
        {
            "id": "FM-L3",
            "name": "Ancestral Blizzard",
            "subtitle": "Legacy Technique",
            "type": "Technique",
            "cost": 3,
            "focusDie": "d8",
            "effect": "Your opponent's cards cost +2 energy to play until the end of your next turn. Draw 2 cards.",
            "drawback": "At the end of your next turn, discard your hand and draw 3 cards.",
            "flavorText": "The ultimate winter storm technique passed through your bloodline summons a perfect blizzard, though the strain forces you to completely reassess your tactical approach afterward.",
            "isLegacy": true,
            "rangeRestriction": "Any"
        }
    ]
  },
  "Lightning Magic": {
      "styleName": "Lightning Magic",
      "styleDescription": "A fast, reactive fighting style focused on chain reactions, burst damage, and rapid strikes, featuring charge accumulation and devastating electrical attacks.",
      "styleType": "Magical",
      "rangePreference": "Far Range",
      "historicalInspiration": "Lightning Magic draws from both experimental electrical studies and esoteric traditions. Western influences include Giambattista della Porta's 'Magia Naturalis' (1558) which documented early electrical phenomena, Benjamin Franklin's 'Experiments and Observations on Electricity' (1751), and the Hermetic Order of the Golden Dawn's 'Liber Fulguris' (c. 1890s) containing thunder invocation rituals. Eastern sources include the Japanese 'Raijin-ki' (雷神記, c. 15th century) detailing thunder god ceremonies, Chinese 'Lei Shu' (雷書, Song Dynasty) on controlling celestial electricity, and Tibetan 'glog-'khor' (lightning wheel) practices described in the 'rGyud-bzhi' medical texts. The Charge resource mechanic reflects concepts from both Franz Mesmer's 'animal magnetism' theory (1775) and the Chinese 'shen-dian' (神電, divine lightning) energy described in Daoist alchemical texts. This style's focus on rapid bursts and chain reactions mirrors early scientific understanding of electrical capacitance as documented in Luigi Galvani's work (1780s) and Eastern concepts of lightning as accumulated yang energy seeking sudden release.",
      "cards": [
          {
              "id": "LM-01",
              "name": "Conduction Stance",
              "subtitle": "Energy Channel",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Conduction Stance. While in this stance, gain 1 Charge when you play a card. When your Charge reaches 5 or more, your next attack deals +2 damage. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage. Gain 1 Charge at the beginning of your turn.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, immediately gain 2 Charge upon entering this stance.",
              "flavorText": "The mage's body crackles with electrical potential, each movement generating new currents that build toward an inevitable discharge.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-02",
              "name": "Faraday Shell",
              "subtitle": "Protective Field",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Faraday Shell stance. While in this stance, when attacked, you may spend 2 Charge to reduce damage by 2. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage. Gain 1 Charge at the beginning of your turn.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, also gain 1 Charge when you reduce damage this way.",
              "flavorText": "Electrical energy forms a protective cage around the mage, redirecting incoming attacks safely into the ground.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-03",
              "name": "Plasma Form",
              "subtitle": "Ionized Escape",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Plasma Form stance. While in this stance, you may spend 3 Charge to change range as a free action. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage. Gain 1 Charge at the beginning of your turn.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, when changing range this way, also deal 1 damage to your opponent.",
              "flavorText": "The lightning mage partially transforms into pure energy, capable of instantly relocating in a flash of blinding light.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-04",
              "name": "Lightning Bolt",
              "subtitle": "Direct Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend up to 4 Charge to add that much additional damage to this attack. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, this attack cannot be reduced by defensive effects.",
              "flavorText": "A concentrated lance of electrical energy arcs toward the opponent, its power amplified by the mage's accumulated charge.",
              "rangeRestriction": "Far Range Only"
          },
          {
              "id": "LM-05",
              "name": "Chain Lightning",
              "subtitle": "Arcing Energy",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage. If you have 3+ Charge, deal 1 additional damage and gain 1 Charge. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, if you have 6+ Charge, deal 2 additional damage instead.",
              "flavorText": "Electricity jumps between multiple points, creating a devastating network of energy that feeds back into the caster's power reserves.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-06",
              "name": "Overload",
              "subtitle": "Energy Release",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Spend all Charge. Deal damage equal to the Charge spent. Draw a card. If you spent 5+ Charge, this damage cannot be reduced by defensive effects.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, deal damage equal to all Charge spent instead of half.",
              "flavorText": "The mage releases all accumulated electrical energy in a single explosive discharge, creating momentary clarity in the aftermath.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-07",
              "name": "Shock Field",
              "subtitle": "Area Denial",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent changes range or stance. Deal 1 damage and gain 2 Charge.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, also prevent your opponent's range or stance change.",
              "flavorText": "A sudden burst of electrical energy fills the area, painfully disrupting the opponent's movement and feeding the mage's power reserves.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-08",
              "name": "Static Build",
              "subtitle": "Charge Accumulation",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Charge. Your next Lightning Magic card costs 1 less energy to play this turn. If you reach 7+ Charge, you must discharge at least 4 Charge on your next turn.",
              "masterEffect": "If you've played 2+ Lightning Magic cards this turn, gain 5 Charge instead of 3.",
              "flavorText": "The air around the mage becomes charged with potential energy, hair standing on end and small sparks dancing across their fingertips.",
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-L1",
              "name": "Ancestral Thunderbolt",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d12",
              "effect": "Deal 2 damage. Spend any amount of Charge to add that much additional damage. If you spend 5+ Charge, this attack affects all ranges and cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, you cannot gain Charge until the end of your next turn.",
              "flavorText": "The perfect lightning technique passed down through your lineage channels the raw power of a thunderstorm, though the strain temporarily burns out your ability to gather new energy.",
              "isLegacy": true,
              "rangeRestriction": "Far Range Only (unless modified)"
          },
          {
              "id": "LM-L2",
              "name": "Generational Current",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Immediately gain 6 Charge. All your Lightning Magic cards cost 1 less energy to play until the end of your next turn. If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage.",
              "drawback": "At the beginning of your next turn, lose health equal to half your current Charge (rounded up).",
              "flavorText": "Drawing upon your ancestors' accumulated understanding of electrical energies grants tremendous power, though your aging body struggles to contain such potent forces.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "LM-L3",
              "name": "Elder's Storm",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Elder's Storm stance. While in this stance, gain 2 Charge at the beginning of your turn. Your attacks cost -1 energy for each 4 Charge you have (minimum 1). If you have 5+ Charge, you may reduce your Charge to 0 to deal 3 additional damage. Gain 1 Charge at the beginning of your turn.",
              "drawback": "While in this stance, you can't have more than 10 Charge. At the end of each turn, take damage equal to your current Charge divided by 4 (rounded up).",
              "flavorText": "The ultimate lightning technique refined over generations manifests as a perpetual storm around your body, granting tremendous power that slowly burns through your weathered frame.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Shadow Magic": {
      "styleName": "Shadow Magic",
      "styleDescription": "A deceptive, control-oriented fighting style focusing on information manipulation, misdirection, and devastating surprise strikes that exploit opponent vulnerabilities.",
      "styleType": "Magical",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "Shadow Magic draws from esoteric traditions focused on darkness, illusion, and hidden knowledge. Western influences include the shadow-working techniques in Johannes Trithemius' 'Steganographia' (1499), Athanasius Kircher's 'Ars Magna Lucis et Umbrae' (1646) on light and shadow manipulation, and the Rosicrucian 'Umbratorum Codex' (c. 1720) detailing shadow projection methods. Eastern sources include the Japanese 'Inton-jutsu' (隠遁術) techniques documented in the 'Bansenshukai' ninja scrolls (1676), the Chinese 'Yin Shu' (陰術, Ming Dynasty) on shadow essence cultivation, and the Tibetan 'grib-gnon' (shadow-suppression) practices in 'Yangtig Nagpo' (ཡང་ཐིག་ནག་པོ་) tantric texts. The Shroud resource mechanic parallels concepts from both Western umbramancy as described in Cornelius Agrippa's 'De Occulta Philosophia' (1533) and the Chinese 'yin-qi' (陰氣) theories of shadow energy accumulation found in Daoist inner alchemy traditions.",
      "cards": [
          {
              "id": "SM-01",
              "name": "Umbral Veil",
              "subtitle": "Concealing Stance",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Umbral Veil stance. While in this stance, when your opponent plays a card, gain 1 Shroud. You may spend 2 Shroud to look at the top card of your opponent's deck.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, your opponent must reveal the next card they draw.",
              "flavorText": "The practitioner manipulates ambient shadows to obscure their movements and stance, creating multiple false silhouettes that make accurate targeting nearly impossible.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-02",
              "name": "Shadow Armor",
              "subtitle": "Protective Darkness",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Shadow Armor stance. While in this stance, you may spend 2 Shroud to reduce damage from an attack by 2.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also gain 1 Shroud when you reduce damage this way.",
              "flavorText": "Concentrated shadow energy forms a protective layer around the caster's body, absorbing impacts and dissipating their force before they can cause full damage.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-03",
              "name": "Dusk Hunter",
              "subtitle": "Predatory Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Dusk Hunter stance. While in this stance, your attacks deal +1 damage if you have 3+ Shroud when the attack resolves.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, your attacks also cannot be reduced by defensive effects if you have 5+ Shroud.",
              "flavorText": "The shadow practitioner assumes a low, coiled stance, using accumulated shadow energy to mask their movements until the precise moment to launch a devastating surprise attack.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-04",
              "name": "Tenebrous Strike",
              "subtitle": "Umbral Assault",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend up to 3 Shroud to add that much additional damage to this attack. If you spend 3+ Shroud on this attack, it can't be reduced by defensive effects or responded to with reactions.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, the opponent must discard a card if this attack deals 4+ damage.",
              "flavorText": "A focused projection of shadow energy launches from an unexpected direction, its impact amplified by the caster's accumulated shadow reserves.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-05",
              "name": "Nightmare Visage",
              "subtitle": "Fear Induction",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage. Your opponent reveals their hand. Gain 1 Shroud for each stance card in their hand. If you spend 3+ Shroud on this attack, it can't be reduced by defensive effects or responded to with reactions.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also gain 1 Shroud for each attack card in their hand.",
              "flavorText": "The caster momentarily distorts their own features into disorienting patterns using shadow techniques, causing momentary psychological shock that reveals the opponent's tactical intentions.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-06",
              "name": "Obscuring Mist",
              "subtitle": "Vision Denial",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Gain 3 Shroud. Your opponent must play with their hand revealed until they change stance. You may spend 2 Shroud to force your opponent to play their next card with its effect revealed before resolving.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also look at the top 3 cards of your opponent's deck and place them back in any order.",
              "flavorText": "A carefully crafted field of shadow particles disrupts the opponent's visual perception, creating blind spots and false images while the caster retains perfect awareness.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-07",
              "name": "Shadow Step",
              "subtitle": "Umbral Teleport",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Spend 2 Shroud to negate that attack and change range.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also deal 1 damage to your opponent.",
              "flavorText": "Using precise shadow manipulation techniques, the practitioner creates a momentary illusion that draws the attack while they rapidly reposition to a more advantageous location.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-08",
              "name": "Gather Darkness",
              "subtitle": "Shadow Harvest",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 2 Shroud. Draw a card. Your next Shadow Magic card costs 1 less energy to play this turn. You may spend 3 Shroud to look at your opponent's hand and choose a card for them to discard.",
              "masterEffect": "If you've played 2+ Shadow Magic cards this turn, gain 4 Shroud instead of 2.",
              "flavorText": "Through controlled breathing and precise gestures, the shadow practitioner accumulates ambient shadow energy, enhancing their capacity for subsequent shadow techniques.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-L1",
              "name": "Ancestral Eclipse",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d12",
              "effect": "Deal 2 damage. Spend any amount of Shroud to add that much additional damage. Your opponent cannot respond to this attack with reactions. If you spend 3+ Shroud on this attack, it can't be reduced by defensive effects or responded to with reactions.",
              "drawback": "After this attack resolves, your opponent may look at your hand until the end of their next turn.",
              "flavorText": "This advanced hereditary technique temporarily blinds all observers with concentrated shadow energy, though the exceptional effort leaves the caster's guard temporarily lowered afterward.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-L2",
              "name": "Generational Darkness",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Immediately gain 5 Shroud. Look at your opponent's hand and the top 3 cards of their deck. Your Shadow Magic cards cost 1 less energy to play until your next turn. You may spend 2 Shroud to look at the top card of your opponent's deck.",
              "drawback": "Skip your draw phase next turn.",
              "flavorText": "This multi-generational technique enhances shadow perception to unprecedented levels, revealing hidden information but taxing the practitioner's mental resources for subsequent planning.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "SM-L3",
              "name": "Void Master's Form",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Enter the Void Master's Form stance. While in this stance, gain 2 Shroud at the beginning of your turn. When targeted by an attack, you may spend 3 Shroud to redirect that attack to deal damage to your opponent instead. You may spend 2 Shroud to look at the top card of your opponent's deck.",
              "drawback": "While in this stance, you must spend 1 Shroud at the end of each of your turns or take 2 damage.",
              "flavorText": "The culmination of centuries of shadow techniques allows masterful redirection of attacks through specialized shadow fields, though maintaining this advanced stance continuously drains either shadow reserves or physical stamina.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Water Magic": {
      "styleName": "Water Magic",
      "styleDescription": "An adaptive, reactive fighting style based on fluid movement and energy redirection, featuring tactical flexibility and powerful counter-techniques.",
      "styleType": "Magical",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "Water Magic draws from numerous historical esoteric and martial traditions that emphasized fluid movement and energy redirection. Western influences include Paracelsus' treatise 'De Meteoris' (1569) which detailed water elemental correspondences, and the 16th century alchemical text 'Rosarium Philosophorum' which codified water's transmutative properties. Eastern inspirations include the water manipulation techniques described in the Taoist text 'Huainanzi' (淮南子, 2nd century BCE) and the Japanese water-based divination system of Mizuura documented in 'Honchō Shokkan' (本朝食鑑, 1697). The Flow resource mechanic parallels concepts from both the medieval European 'humoral theory' of Galen and the Chinese 'Five Phase' theory where water represents adaptability and constant change. The style's mechanics of redirection and counter-techniques also draw from historical martial arts that emphasized yielding to an opponent's force, such as those documented in Chen Wangting's Taiji principles (17th century) and Japanese jūjutsu scrolls like the 'Kito-ryu Mokuroku' (起倒流目録, 18th century).",
      "cards": [
          {
              "id": "WM-01",
              "name": "Flowing Stance",
              "subtitle": "Adaptive Guard",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Flowing Stance. While in this stance, when your opponent plays a card or attacks you, gain 1 Flow.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, you may spend 2 Flow to draw a card.",
              "flavorText": "The water mage adopts a fluid posture, their body seeming to ripple like the surface of a pond, ready to absorb and redirect any energy sent their way.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-02",
              "name": "Crashing Wave",
              "subtitle": "Aggressive Surge",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Crashing Wave stance. While in this stance, you may spend any amount of Flow when you play an attack to add that much additional damage.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, your next attack costs 1 less energy for each 2 Flow you have (minimum 1).",
              "flavorText": "The mage gathers magical currents around them, their movements becoming powerful and directed like a wave building momentum before breaking upon the shore.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-03",
              "name": "Ice Shield",
              "subtitle": "Defensive Barrier",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Ice Shield stance. While in this stance, you may spend 2 Flow to reduce damage from an attack by 2.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, gain 1 Flow each time you reduce damage.",
              "flavorText": "Water solidifies into crystalline patterns around the mage, forming a translucent barrier that absorbs impacts before melting back into the magical current.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-04",
              "name": "Tidal Surge",
              "subtitle": "Forceful Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend any amount of Flow to add that much additional damage.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, change range after this attack resolves if desired.",
              "flavorText": "A massive wave of magical water rushes forth, its power amplified by the collected energies the mage has gathered from previous exchanges.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-05",
              "name": "Whirlpool Strike",
              "subtitle": "Disruptive Attack",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage. Your opponent must discard a Focus card. When your opponent plays a card or attacks you, gain 1 Flow.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, also force your opponent to exit their current stance.",
              "flavorText": "The water mage creates a swirling vortex that tears at the opponent's concentration, disrupting their carefully gathered energies.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-06",
              "name": "Waterspout",
              "subtitle": "Positional Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Deal 2 damage and change range. Gain Flow equal to the damage dealt. If your opponent attacked you this turn, gain 1 additional Flow.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, if you have 4+ Flow, this attack cannot be reduced by defensive effects.",
              "flavorText": "A column of enchanted water erupts from below, carrying both combatants to a new position while the mage harnesses the chaotic energies released.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-07",
              "name": "Redirect Current",
              "subtitle": "Defensive Counter",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and gain Flow equal to the original damage amount. You may spend 2 Flow to redirect that attack back at your opponent.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, also deal 1 damage to your opponent.",
              "flavorText": "With subtle gestures, the water mage catches the incoming force and channels it into their own reservoir of power, weakening the blow while strengthening themselves.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-08",
              "name": "Gather Currents",
              "subtitle": "Energy Collection",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 3 Flow. Your next Water Magic card costs 1 less to play this turn.",
              "masterEffect": "If you've played 2+ Water Magic cards this turn, also change stance if desired without paying its cost.",
              "flavorText": "The mage centers themselves, feeling the subtle flows of magical energy around them and drawing them inward for future use.",
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-L1",
              "name": "Ancestral Torrent",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend any amount of Flow to add that much additional damage. If you spend 4+ Flow, this attack cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, you cannot gain Flow until the end of your next turn.",
              "flavorText": "The perfect water technique passed down through generations, channeling destructive flood power that few can withstand, though the strain leaves your magical channels temporarily exhausted.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-L2",
              "name": "Generational Redirection",
              "subtitle": "Legacy Reaction",
              "type": "Reaction",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Play when your opponent plays an attack. Negate that attack completely and deal damage to your opponent equal to half the attack's damage (rounded up).",
              "drawback": "After this reaction resolves, discard your hand and draw 3 cards.",
              "flavorText": "The ultimate defensive technique refined through your bloodline creates a perfect mirror of water that returns harm to its source, though the spiritual exertion forces a complete reset of your tactical approach.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "WM-L3",
              "name": "Elder's Reservoir",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Gain 6 Flow immediately. All your Water Magic cards cost 1 less energy to play until the end of your next turn.",
              "drawback": "Lose 2 health when you play this card.",
              "flavorText": "Decades of practice allow you to open the deepest channels of water energy beyond what younger mages can access, though your aging body struggles to contain such power without damage.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Bow": {
      "styleName": "Bow",
      "styleDescription": "A precision-focused ranged combat style based on historical archery techniques, featuring range advantages, tactical positioning, and calculated strikes.",
      "styleType": "Martial",
      "rangePreference": "Far Range",
      "historicalInspiration": "The Bow style draws from diverse archery traditions across multiple cultures and time periods. Primary influences include English longbow techniques (12th-16th centuries CE), which revolutionized medieval warfare; Japanese Kyudo (the 'way of the bow'), which emphasizes precision and spiritual aspects of archery; Mongolian mounted archery tactics that dominated Asian warfare for centuries; and Middle Eastern composite bow techniques that emphasized power and accuracy. The style combines tactical positioning elements with both military and hunting applications of archery throughout history.",
      "cards": [
          {
              "id": "BW-01",
              "name": "Drawn Bow",
              "subtitle": "Poised to Strike",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Drawn Bow stance. While in this stance, your attacks deal +2 damage at Far Range but you cannot change to Close Range.",
              "masterEffect": "If you've played 2+ Bow cards this turn, your next attack ignores defensive effects.",
              "flavorText": "The archer draws the bowstring to full tension, muscles locked and breathing controlled, creating the perfect platform for a devastating shot.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on the English longbow draw technique, where archers would hold their bows at full draw until commanded to loose, creating a devastating volley. This technique was notably employed at the Battle of Agincourt (1415), where English longbowmen decimated French knights. The stance also incorporates elements of Kyudo's 'kai' position, where the archer achieves complete focus at full draw."
          },
          {
              "id": "BW-02",
              "name": "Loose Stance",
              "subtitle": "Fluid Position",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Loose Stance. While in this stance, you may change range once per turn as a free action.",
              "masterEffect": "If you've played 2+ Bow cards this turn, also draw a card when changing range.",
              "flavorText": "The archer maintains a light-footed stance, constantly shifting position between shots to exploit terrain advantages and maintain optimal firing distance.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Inspired by Mongolian mounted archery techniques, where warriors would shoot while in motion, constantly adjusting their position relative to targets. Historical accounts describe Mongolian archers being able to shoot accurately while advancing, retreating, or circling their targets. The 'Parthian shot' technique (shooting while retreating) also influences this card."
          },
          {
              "id": "BW-03",
              "name": "Covered Position",
              "subtitle": "Defensive Archery",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Covered Position stance. While in this stance, reduce damage by 1. If at Far Range, reduce damage by 2 instead.",
              "masterEffect": "If you've played 2+ Bow cards this turn, opponents cannot change to Far Range unless they discard a card.",
              "flavorText": "The archer takes partial cover behind natural terrain, exposing only enough of their body to maintain line of sight while protecting vital areas.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on techniques used by English and Welsh archers who would position behind stakes or natural terrain features. Historical accounts from the Hundred Years' War describe archers exploiting terrain features for protection. Also incorporates elements from Native American hunting techniques, where hunters would use natural cover to conceal themselves from prey while maintaining line of sight."
          },
          {
              "id": "BW-04",
              "name": "Precise Shot",
              "subtitle": "Calculated Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. If at Far Range, deal 4 damage instead.",
              "masterEffect": "If you've played 2+ Bow cards this turn, your opponent cannot change range next turn.",
              "flavorText": "Taking a moment to account for distance, wind, and target movement, the archer releases a single arrow with perfect form, striking exactly as intended.",
              "rangeRestriction": "Far Range preferred",
              "historicalInspiration": "Draws from Japanese Kyudo practices, which emphasize hitting targets with a single perfect shot rather than multiple attempts. The technique also references Turkish and Persian archery traditions, where precision shooting was demonstrated through feats like splitting an arrow already in a target (documented in Ottoman archery manuals) or hitting small targets at extreme distances."
          },
          {
              "id": "BW-05",
              "name": "Rapid Volley",
              "subtitle": "Flurry of Arrows",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage. Roll your stance's focus die; deal additional damage equal to half the result (rounded up).",
              "masterEffect": "If you've played 2+ Bow cards this turn, roll the die twice and use the higher result.",
              "flavorText": "The archer's hands move in a blur, nocking and loosing arrow after arrow in rapid succession, sacrificing precision for overwhelming volume.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on the legendary speed of English longbowmen, who could reportedly loose 10-12 arrows per minute in battle. This rate of fire was demonstrated at the Battle of Crécy (1346) and other major engagements of the Hundred Years' War. The technique is also influenced by rapid-fire methods from various Asian traditions, where archers would hold multiple arrows in their draw hand."
          },
          {
              "id": "BW-06",
              "name": "Point Blank Shot",
              "subtitle": "Desperate Measure",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 3 damage if at Close Range. Then change to Far Range.",
              "masterEffect": "If you've played 2+ Bow cards this turn, also force your opponent to discard a Focus card.",
              "flavorText": "When an enemy closes in, the archer waits until the last possible moment before loosing a powerful shot at minimal distance before leaping backward.",
              "rangeRestriction": "Close Range only",
              "historicalInspiration": "Inspired by accounts from medieval battles where archers would use their bows as emergency weapons at close quarters. The technique is also influenced by Kyudo's 'hikiwake' practice, where archers shoot at extremely close range to develop proper technique. Historical evidence from English battles shows archers engaging in close combat when enemies breached their positions."
          },
          {
              "id": "BW-07",
              "name": "Tactical Retreat",
              "subtitle": "Create Distance",
              "type": "Reaction",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Play when attacked at Close Range. Change to Far Range and reduce the damage by 2.",
              "masterEffect": "If you've played 2+ Bow cards this turn, also draw a card.",
              "flavorText": "The archer executes a practiced backward roll while simultaneously nocking an arrow, creating critical distance in one fluid defensive motion.",
              "rangeRestriction": "Close Range only",
              "historicalInspiration": "Based on the 'Parthian shot' technique developed by Parthian mounted archers (247 BCE–224 CE), who would feign retreat to lure enemies into pursuit, then turn in the saddle to shoot while continuing to ride away. This tactic was later adopted by Mongol, Turkish, and other Central Asian mounted archers."
          },
          {
              "id": "BW-08",
              "name": "Nocking Draw",
              "subtitle": "Preparation",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Your next Bow attack this turn costs 1 less energy. If at Far Range, it also deals +1 damage.",
              "masterEffect": "If you've played 2+ Bow cards this turn, also change to Far Range.",
              "flavorText": "With methodical precision, the archer selects the perfect arrow and positions it on the string, the entire process optimized for the upcoming shot.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Reflects the methodical preparation emphasized in Japanese Kyudo, where the process of nocking the arrow (yazuke) is one of the eight stages of proper shooting. Also draws from medieval English training, where archers practiced to achieve maximum efficiency in nocking arrows to maintain their rate of fire in battle."
          },
          {
              "id": "BW-L1",
              "name": "Ancestral Marksman",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 4,
              "focusDie": "d12",
              "effect": "Deal 3 damage. If at Far Range, deal 5 damage instead. This attack cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, you cannot play any attack cards on your next turn.",
              "flavorText": "Your bloodline's centuries of archery mastery culminate in this perfect shot, though your aging joints now struggle to nock another arrow immediately after.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Inspired by legendary marksmen from various cultures, such as the Japanese master Nasuno Yoichi, who reportedly shot a fan off a pole on a moving boat during the Battle of Yashima (1184). Also draws from the feat of the Ottoman archer Tozkoparan Iskender, who could reportedly shoot an arrow over 800 meters, a record documented in Turkish archery texts."
          },
          {
              "id": "BW-L2",
              "name": "Inherited Range Mastery",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Change to Far Range. Your next two Bow attacks this turn cost 2 less energy to play and gain +1 damage.",
              "drawback": "At the end of your turn, discard all cards in your hand greater than cost 2.",
              "flavorText": "Generations of tactical positioning knowledge flow through your veins, though accessing such profound skill taxes your weathered frame.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on archery families from cultures with strong family-based training traditions, such as the samurai archer clans of feudal Japan and the Korean royal court archery families. These families developed specialized techniques passed down through generations, often with specific tactical approaches unique to their lineage."
          },
          {
              "id": "BW-L3",
              "name": "Generational Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Generational Defense stance. While in this stance, all damage taken is reduced by 2. When you're attacked, you may immediately change to Far Range.",
              "drawback": "While in this stance, your attacks cost 1 additional energy and you cannot play cards while at Close Range.",
              "flavorText": "Your ancestral defensive techniques are unmatched, having been refined through countless battles, though your aging body now requires greater distance to effectively attack.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Draws from defensive archery tactics used by steppe nomads and Mongolian horse archers, who would maintain mobile defensive formations while continuously repositioning to optimal range. Also incorporates elements from English and Welsh archery tactics during the defensive phases of battles, where maintaining distance from enemy forces was critical."
          }
      ]
  },
  "Battle Axe": {
      "styleName": "Battle Axe",
      "styleDescription": "An offense-focused fighting style based on historical Viking and medieval axe techniques, featuring momentum building and powerful cleaving attacks.",
      "styleType": "Martial",
      "rangePreference": "Close Range",
      "historicalInspiration": "The Battle Axe style draws primarily from Viking and Norse combat traditions (8th-11th centuries), as well as later medieval European battlefield axe techniques. Viking warriors were known for their devastating axe techniques that emphasized power and momentum. The style also incorporates elements from the later medieval battleaxe, which evolved as a counter to plate armor, with techniques focused on concentrating force to penetrate or damage armored opponents.",
      "cards": [
          {
              "id": "BA-01",
              "name": "Høggva",
              "subtitle": "Cleaving Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d10",
              "effect": "Enter the Høggva stance. While in this stance, gain +1 Momentum when you deal damage.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, immediately gain 2 Momentum upon entering this stance.",
              "flavorText": "The warrior raises the axe high with legs braced wide apart, each swing building force for the next in a devastating chain of attacks.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Derived from Old Norse term 'höggva' meaning 'to strike/chop'. This stance reflects the aggressive overhead position commonly seen in Norse sagas and archaeological evidence of combat injuries consistent with powerful downward strikes."
          },
          {
              "id": "BA-02",
              "name": "Skjaldborg",
              "subtitle": "Shield Wall",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Skjaldborg stance. While in this stance, when attacked, you may spend 2 Momentum to reduce damage by 2. Lose all Momentum after this effect resolves.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, reduce damage by 3 instead.",
              "flavorText": "The fighter positions the axe haft to deflect incoming strikes, using the broad head to catch and redirect enemy weapons.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on the famous Viking 'shield-wall' formation (skjaldborg in Old Norse). While primarily a group tactic, individual warriors adopted similar principles, using their weapons defensively when needed."
          },
          {
              "id": "BA-03",
              "name": "Sviða",
              "subtitle": "Sweeping Guard",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d8",
              "effect": "Enter the Sviða stance. While in this stance, if an opponent's attack misses or is fully blocked, If you dealt damage this turn, gain 1 Momentum.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, you may immediately spend Momentum to deal that much damage to your opponent.",
              "flavorText": "The warrior keeps the axe in constant motion at waist height, creating a defensive perimeter that builds energy with each successful deflection.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Inspired by the sweeping defensive movements found in later medieval pollaxe techniques, particularly those in the tradition of Le Jeu de la Hache (15th century French axe manual)."
          },
          {
              "id": "BA-04",
              "name": "Brotna",
              "subtitle": "Sunder Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d12",
              "effect": "Deal 2 damage. You may spend up to 3 Momentum to add that much additional damage. Lose all Momentum after this effect resolves. If you have 3+ Momentum, this attack deals +1 damage.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, this attack also forces your opponent to discard a Focus card.",
              "flavorText": "The axe-wielder channels accumulated force into a single devastating overhead chop capable of splitting shields and crushing armor with sheer power.",
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "From Old Norse 'brotna' meaning 'to break'. Based on archaeological evidence of shield damage patterns and saga accounts of axes breaking through shields and armor in a single powerful blow."
          },
          {
              "id": "BA-05",
              "name": "Krækja",
              "subtitle": "Hook Pull",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 1 damage and pull your opponent into your stance advantage (if any). If you dealt damage this turn, gain 1 Momentum. If you have 3+ Momentum, this attack deals +1 damage.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, also force opponent to exit their current stance.",
              "flavorText": "With practiced efficiency, the warrior hooks the axe head behind an opponent's shield or limb and violently yanks them off-balance into a vulnerable position.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on the hook (krókr in Old Norse) feature present on many Viking axe heads, specifically designed to pull enemy shields or create openings in their defense."
          },
          {
              "id": "BA-06",
              "name": "Tvíhenda",
              "subtitle": "Double-Handed Swing",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 3 damage. If you have 4+ Momentum, this attack cannot be reduced by defensive effects. If you have 3+ Momentum, this attack deals +1 damage.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, gain Momentum equal to the damage dealt.",
              "flavorText": "Gripping the axe with both hands wide apart, the fighter delivers a sweeping arc that cuts through defenses with unstoppable centrifugal force.",
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "From Old Norse 'tvíhenda' meaning 'two-handed'. Refers to the technique of using the long-handled Dane axe with both hands, a weapon that became prominent in the late Viking Age."
          },
          {
              "id": "BA-07",
              "name": "Kasta",
              "subtitle": "Throwing Axe",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Deal 2 damage and spend all Momentum. For each Momentum spent, deal +1 damage. Lose all Momentum after this effect resolves.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, draw a card after this attack resolves.",
              "flavorText": "With split-second timing, the warrior hurls a smaller throwing axe to intercept an incoming attack, the spinning blade slicing through the air with deadly precision.",
              "rangeRestriction": "Any",
              "historicalInspiration": "From Old Norse 'kasta' meaning 'to throw'. Based on the Francisca and other throwing axes used by Norse warriors and Frankish troops. Archaeological and historical accounts confirm the practice of carrying smaller axes specifically for throwing."
          },
          {
              "id": "BA-08",
              "name": "Bylgjur",
              "subtitle": "Waves of Force",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 2 Momentum. Your next Battle Axe attack costs 1 less to play this turn. If you don't attack on your turn, lose all Momentum at the end of your turn.",
              "masterEffect": "If you've played 2+ Battle Axe cards this turn, also draw a card for every 3 Momentum you have.",
              "flavorText": "The fighter performs a series of rhythmic feints and practice swings, each motion building kinetic energy that will be unleashed in a devastating assault.",
              "rangeRestriction": "Any",
              "historicalInspiration": "From Old Norse 'bylgja' meaning 'wave'. Based on accounts and martial theories of sequential striking patterns that build force through rhythmic movement, found in various Northern European fighting traditions."
          },
          {
              "id": "BA-L1",
              "name": "Ancestral Cleave",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 4,
              "focusDie": "d12",
              "effect": "Deal 3 damage. You may spend any amount of Momentum to add that much additional damage. This attack cannot be reduced by defensive effects. Lose all Momentum after this effect resolves. If you have 3+ Momentum, this attack deals +1 damage.",
              "drawback": "After this attack resolves, lose all remaining Momentum and take 1 damage.",
              "flavorText": "The technique handed down through your bloodline harnesses generations of battle wisdom, though the strain of executing it perfectly takes its toll on your aging body.",
              "isLegacy": true,
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "Inspired by legendary berserker techniques described in Norse sagas, particularly the near-mythical accounts of warriors who could deliver devastating blows at the cost of their own well-being."
          },
          {
              "id": "BA-L2",
              "name": "Elder's Momentum",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain a Momentum immediately. Your next Battle Axe attack costs 2 less energy to play.",
              "drawback": "Skip your draw phase next turn.",
              "flavorText": "Your family's mastery of momentum has been refined across generations, though summoning such force now depletes your reserves quickly.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on accounts from various warrior cultures where techniques were refined and passed down through generations, with elders often sacrificing their own stamina to execute perfect form."
          },
          {
              "id": "BA-L3",
              "name": "Hereditary Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d10",
              "effect": "Enter the Hereditary Defense stance. While in this stance, gain 2 Momentum when attacked and reduce damage by 1.",
              "drawback": "When you exit this stance, lose 2 health.",
              "flavorText": "The defensive techniques passed down through your bloodline are devastatingly effective, though the jarring impacts reverberate through your weathered frame.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Inspired by families of weapon masters throughout history who developed their own specialized defensive techniques, particularly drawing from Norse and Germanic traditions where combat skills were considered important family inheritance."
          }
      ]
  },
  "Longsword": {
      "styleName": "Longsword",
      "styleDescription": "A balanced fighting style based on historical German longsword techniques, featuring tactical stance-switching and powerful strikes.",
      "styleType": "Martial",
      "rangePreference": "Close Range",
      "historicalInspiration": "The Longsword style is primarily based on the German school of swordsmanship (Kunst des Fechtens) from the 14th-16th centuries, particularly the teachings of Johannes Liechtenauer and his successors. This martial tradition was documented in fight books (Fechtbücher) by masters like Hans Talhoffer, Sigmund Ringeck, and Joachim Meyer. The style emphasizes versatility through stance transitions, powerful strikes (Meisterhau or 'master cuts'), and a balanced approach to both offense and defense. The German longsword tradition was developed for unarmored dueling and evolved alongside developments in armor and battlefield tactics throughout the late medieval and Renaissance periods.",
      "cards": [
          {
              "id": "LS-01",
              "name": "Vom Tag",
              "subtitle": "From the Roof",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Vom Tag stance. While in this stance, your attacks deal +1 damage.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, also draw 1 card when you deal damage.",
              "flavorText": "The swordsman holds the blade high overhead, muscles coiled like a spring, ready to deliver crushing overhead blows.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Vom Tag (From the Day/Roof) is one of the four primary guards (Leger) in the German longsword tradition, documented in numerous Fechtbücher including Sigmund Ringeck's manuscript (c. 1440). The high position allows for powerful downward strikes while controlling the center line. Images from period manuscripts show fighters adopting this stance with the sword held either centrally or on the right shoulder."
          },
          {
              "id": "LS-02",
              "name": "Alber",
              "subtitle": "Fool's Guard",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Alber stance. While in this stance, reduce damage from attacks by 1.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, also force your opponent to spend +1 energy for their next attack.",
              "flavorText": "The blade points downward, tip nearly touching the ground, luring opponents into overextending their attacks through apparent vulnerability.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Alber (Fool's Guard) appears in Johannes Liechtenauer's verse glosses and is illustrated in various Fechtbücher including those by Paulus Kal and Peter von Danzig. Despite its seemingly weak position with the sword point low, it was considered deceptively powerful as it invited opponents to attack, creating opportunities for swift counters. The name suggests that only a fool would use such a seemingly vulnerable position—or that opponents are fools for attacking it."
          },
          {
              "id": "LS-03",
              "name": "Ochs",
              "subtitle": "Ox Guard",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Ochs stance. While in this stance, when attacked, you may change to a different stance immediately after damage is resolved.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, reduce the next attack's damage by 2 instead of changing stance.",
              "flavorText": "The sword is held at temple height, point aimed at the opponent's face, creating a defensive position that can instantly transition to any other guard.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Ochs (Ox) is another of the four main guards in Liechtenauer's tradition, appearing in manuscripts from the 14th-16th centuries. The sword is held at temple height with the point aimed at the opponent's face. Historical texts describe this guard as particularly good for thrusting attacks and quick transitions to other positions. It was typically practiced on both the left and right sides, as illustrated in Meyer's 1570 treatise 'Kunst des Fechtens'."
          },
          {
              "id": "LS-04",
              "name": "Zwerchhau",
              "subtitle": "Thwart Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 3 damage. If you're in an Aggressive stance, this attack cannot be reduced by defensive effects.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, also force opponent to exit their current stance.",
              "flavorText": "A powerful horizontal cut delivered with the strong of the blade, catching opponents off-guard by attacking from an unexpected angle.",
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "The Zwerchhau (Thwart Strike) is one of the five 'master cuts' (Meisterhau) in the Liechtenauer tradition. It appears in numerous manuscripts including Ringeck's and von Danzig's. This horizontal strike was executed with the hilt high and the point low, creating an unexpected angle of attack that could defeat an opponent's guard. It was particularly effective against overhead strikes, as it would simultaneously defend and attack by hitting with the strong of the blade."
          },
          {
              "id": "LS-05",
              "name": "Krumphau",
              "subtitle": "Crooked Strike",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 2 damage. If you're in a Defensive stance, draw 1 card.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, deal 3 damage instead.",
              "flavorText": "A diagonal strike that targets the opponent's hands or forearms, simultaneously deflecting their weapon while delivering a disabling cut.",
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "The Krumphau (Crooked Strike) is another of the five master cuts, documented in sources like Codex Wallerstein and Paulus Kal's Fechtbuch. This diagonal strike was specifically designed to target the opponent's hands or forearms while simultaneously displacing their blade. Period texts describe it as being delivered across the opponent's sword with a rotation of the hands, allowing the strike to come in from an unexpected angle."
          },
          {
              "id": "LS-06",
              "name": "Schielhau",
              "subtitle": "Squinting Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Deal 2 damage. If you're in an Evasive stance, change to an Aggressive stance after this attack resolves.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, this attack deals +2 damage if you change stance.",
              "flavorText": "The swordsman delivers a powerful downward cut using the false edge, breaking through the opponent's guard with deceptive angle and timing.",
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "The Schielhau (Squinting Strike) is another master cut in Liechtenauer's system, appearing in Ringeck's glosses and other period sources. It was executed with the false edge of the blade in a downward diagonal cut, designed to break through an opponent's guard. The name comes from looking 'askance' or 'squinting' at the opponent during delivery. Historical texts specifically note its effectiveness against the Pflug (Plow) guard."
          },
          {
              "id": "LS-07",
              "name": "Nachreisen",
              "subtitle": "Following After",
              "type": "Reaction",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Play when your opponent changes stance. Deal 1 damage and draw 1 card.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, also enter any stance of your choice without paying its cost.",
              "flavorText": "As the opponent shifts position, the swordsman immediately exploits the momentary vulnerability with a quick thrust to the opening created.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Nachreisen (Following After) is one of the core tactical concepts in German longsword, described in numerous Fechtbücher including Ringeck's glosses of Liechtenauer's verses. It refers to the technique of exploiting an opponent's movement or recovery by 'following after' them to attack during a moment of vulnerability. The principle teaches fighters to attack into the opponent's recovery or retreat, catching them between actions."
          },
          {
              "id": "LS-08",
              "name": "Winden",
              "subtitle": "Winding",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d6",
              "effect": "If you're in a stance, you may change to any other stance. Then deal 1 damage.",
              "masterEffect": "If you've played 2+ Longsword cards this turn, negate the next stance advantage your opponent would gain against you this turn.",
              "flavorText": "The swordsman twists the blade around the opponent's weapon in a fluid motion, transitioning seamlessly from one position to another while maintaining pressure.",
              "rangeRestriction": "Any",
              "historicalInspiration": "Winden (Winding) is a fundamental concept in German longsword, extensively described in Liechtenauer's teachings and subsequent Fechtbücher. It involves rotating or 'winding' the sword during blade contact to change the angle of attack while maintaining pressure. This allowed the swordsman to seamlessly transition between guards while threatening the opponent. Historical texts describe eight primary windings (vier winden) that could be executed from the bind."
          },
          {
              "id": "LS-L1",
              "name": "Ancestral Master's Cut",
              "subtitle": "Legacy Technique",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 4 damage. If you're in a stance, this attack cannot be reduced by defensive effects.",
              "drawback": "After resolving this attack, you cannot change stance until the end of your next turn.",
              "flavorText": "Your bloodline has perfected this devastating cut through generations of refinement, though executing it now strains your battle-worn body.",
              "isLegacy": true,
              "rangeRestriction": "Close Range Only",
              "historicalInspiration": "Inspired by the lineage of German fencing masters who claimed to preserve Liechtenauer's \"secret\" or \"hidden\" techniques. Historical sources reveal that swordsmanship was often passed down through family lines, with masters guarding their most effective techniques. This card represents a perfected version of what the historical texts call a Meisterschlag (master stroke), a technique that combines elements of multiple master cuts into a single devastating attack."
          },
          {
              "id": "LS-L2",
              "name": "Inherited Wisdom",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Draw 2 cards. Your next Longsword card costs 2 less energy to play this turn.",
              "drawback": "Discard a card from your hand.",
              "flavorText": "The collected wisdom of your ancestors flows through your veins, though accessing such knowledge taxes your aging mind.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "References the concept of the fencing manuscript (Fechtbuch) tradition itself, where martial knowledge was preserved in writing for future generations. Many German masters created such texts to preserve their knowledge, often dedicating them to noble patrons. This card represents the accumulated tactical wisdom preserved in texts like the Codex Wallerstein, Gladiatoria manuscript, and von Danzig fechtbuch, which contained the collective experience of generations of swordsmen."
          },
          {
              "id": "LS-L3",
              "name": "Generational Guard",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Generational Guard stance. While in this stance, reduce all damage by 2. When an opponent attacks you, they must discard a card.",
              "drawback": "While in this stance, your attacks cost +1 energy to play.",
              "flavorText": "Your family's defensive techniques have been refined over decades, though maintaining such perfect form now requires greater effort.",
              "isLegacy": true,
              "rangeRestriction": "Any",
              "historicalInspiration": "Based on the concept of Eiserne Pforte (Iron Gate), a specialized guard described in several German fighting manuals including Peter von Danzig's manuscript. It was considered particularly strong defensively while still allowing counter-attacks. The stance combines elements of historical Eiserne Pforte with Kron (Crown), another defensive position used to catch and control an opponent's blade, creating a synthesized guard that represents generations of defensive refinement."
          }
      ]
  },
  "Rapier & Dagger": {
      "styleName": "Rapier & Dagger",
      "styleDescription": "A technical, combo-oriented fighting style based on historical European dueling techniques, featuring precision, quick ripostes, and deadly combinations.",
      "styleType": "Martial",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "This style is primarily inspired by 16th and 17th century Italian rapier traditions, particularly those documented in Salvator Fabris' 'Lo Schermo, overo Scienza d'Arme' (1606) and Ridolfo Capo Ferro's 'Gran Simulacro dell'Arte e dell'Uso della Scherma' (1610). The stance names reflect the Italian numerical guard positions, while the attack terminology draws from historical Italian fencing manuals. The combination of rapier and dagger was common among nobility and duelists of the Renaissance period, offering both offensive precision and defensive versatility.",
      "cards": [
          {
              "id": "RD-01",
              "name": "Prima",
              "subtitle": "First Position",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Prima stance. While in this stance, when you play an attack, gain 1 Precision point.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to make your next attack this turn cost 2 less.",
              "flavorText": "The duelist presents the rapier high with dagger low, controlling the line while preparing for swift attacks at any opening.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-02",
              "name": "Terza",
              "subtitle": "Third Position",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Terza stance. While in this stance, after you receive damage, gain 1 Precision point.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to reduce damage by 2.",
              "flavorText": "A balanced guard with rapier extended, dagger covering the inside line, perfect for parrying and responding with swift counters.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-03",
              "name": "Quinta",
              "subtitle": "Fifth Position",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d8",
              "effect": "Enter the Quinta stance. While in this stance, you may change range for 0 energy once per turn. Gain 1 Precision point when you change range.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 3 Precision points to enter any stance without paying its cost.",
              "flavorText": "The blade is held low with body angled, creating a deceptive distance while preparing for a lightning lunge or sudden retreat.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-04",
              "name": "Stoccata",
              "subtitle": "Lunging Thrust",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend up to 3 Precision points to add that much additional damage. If you've dealt damage this turn, gain 1 Precision. If you have 5+ Precision, this attack ignores defensive effects.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, if you spend 3 or more Precision points, this attack cannot be reduced by defensive effects.",
              "flavorText": "A perfectly timed thrust extending with the full body, the blade finding its mark with pinpoint accuracy amplified by perfect technique.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-05",
              "name": "Intagliata",
              "subtitle": "Cutting Slash",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 1 damage. If at Close Range, your dagger also deals 1 damage. Gain 1 Precision point. If you've dealt damage this turn, gain 1 Precision. If you have 5+ Precision, this attack ignores defensive effects.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, change to any stance after this attack resolves, without paying its cost.",
              "flavorText": "A diagonal slash with the rapier followed immediately by a swift dagger cut, the dual weapons working in perfect harmony.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-06",
              "name": "Imbrocatta",
              "subtitle": "Downward Thrust",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 2 damage. If you have 3+ Precision points, draw a card after this attack resolves. If you've dealt damage this turn, gain 1 Precision. If you have 5+ Precision, this attack ignores defensive effects.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, also force your opponent to exit their current stance.",
              "flavorText": "A descending thrust aimed at the opponent's shoulder or chest, executed with perfect economy of motion to leave no opening for counterattack.",
              "rangeRestriction": "Close Range Only"
          },
          {
              "id": "RD-07",
              "name": "Parata e Risposta",
              "subtitle": "Parry and Riposte",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1, then deal 1 damage. Gain 1 Precision point. If you have 4+ Precision, this counter-attack deals double damage.",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to deal 2 additional damage.",
              "flavorText": "The dagger deflects the incoming strike with delicate precision, immediately followed by a devastating rapier thrust into the opening created.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-08",
              "name": "Girata",
              "subtitle": "Circular Footwork",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 2 Precision points. You may change range. Your next Rapier & Dagger card costs 1 less to play this turn. If you've dealt damage this turn, gain 1 additional Precision for each damage dealt (maximum 3).",
              "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, also draw a card.",
              "flavorText": "The duelist steps gracefully to the side with perfect balance, simultaneously repositioning for advantage while preparing the next sequence of attacks.",
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-L1",
              "name": "Ancestral Strike",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend any amount of Precision points to add that much additional damage. For each 2 Precision points spent, draw a card. If you have 5+ Precision, this attack ignores defensive effects.",
              "drawback": "After this attack resolves, lose all remaining Precision points and skip your next Focus phase.",
              "flavorText": "The perfect strike handed down through generations, combining speed and precision that few can match, though the strain on aging joints is evident in your follow-through.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-L2",
              "name": "Elder's Precision",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain 5 Precision points immediately. Your next two Rapier & Dagger cards each cost 1 less to play this turn.",
              "drawback": "Discard two cards from your hand.",
              "flavorText": "Decades of practice flow through your veins, summoning perfect technique that transcends conscious thought, though accessing such mastery taxes your weathered mind.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "RD-L3",
              "name": "Hereditary Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Hereditary Defense stance. While in this stance, when attacked, gain 2 Precision points and reduce damage by 1. You may spend 3 Precision points to negate an attack completely.",
              "drawback": "At the end of each turn while in this stance, take 1 damage.",
              "flavorText": "The defensive technique refined through your bloodline creates an impenetrable barrier of steel, though maintaining such perfect form strains your battle-worn body.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Spear": {
      "styleName": "Spear",
      "styleDescription": "A zone control fighting style based on historical spear techniques, featuring reach advantage, range manipulation, and area control tactics.",
      "styleType": "Martial",
      "rangePreference": "Flexible Range",
      "historicalInspiration": "This style draws primarily from Japanese sōjutsu (yari/spear techniques) of feudal Japan, with influences from European pike formations and Chinese qiangfa (spear methods). The stances are based on kamae positions from the Tenshin Shōden Katori Shintō-ryū and other traditional Japanese martial schools that included spear combat.",
      "cards": [
          {
              "id": "SP-01",
              "name": "Hoko-no-kamae",
              "subtitle": "Spear Guard",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Hoko-no-kamae stance. While in this stance, your attacks deal +1 damage at Far Range. You may spend 2 Reach to prevent your opponent from changing range until your next turn.",
              "masterEffect": "If you've played 2+ Spear cards this turn, also gain 1 Reach Advantage when you deal damage at Far Range.",
              "flavorText": "The warrior extends the spear with perfect balance, creating a deadly zone that opponents must navigate with extreme caution.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-02",
              "name": "Gedan-gamae",
              "subtitle": "Low Guard",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 1,
              "focusDie": "d6",
              "effect": "Enter the Gedan-gamae stance. While in this stance, reduce damage from Close Range attacks by 1. Gain 1 Reach Advantage when changing to Far Range. You may spend 2 Reach to prevent your opponent from changing range until your next turn.",
              "masterEffect": "If you've played 2+ Spear cards this turn, after reducing damage, you may change range.",
              "flavorText": "The spear is held low and angled, creating a defensive barrier while preparing to extend distance with a swift backward step.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-03",
              "name": "Chudan-gamae",
              "subtitle": "Middle Guard",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Chudan-gamae stance. While in this stance, you may spend 2 Reach to change range and draw a card. You may spend 2 Reach to prevent your opponent from changing range until your next turn.",
              "masterEffect": "If you've played 2+ Spear cards this turn, also reduce the next attack's damage by 1 after changing range.",
              "flavorText": "The spear is held at center height with perfect balance, allowing swift transitions between advance and retreat with minimal telegraph.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-04",
              "name": "Tsuki",
              "subtitle": "Thrusting Strike",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. If at Far Range, deal +1 damage and gain 1 Reach Advantage. While at Far Range with 3+ Reach, this attack deals +1 damage.",
              "masterEffect": "If you've played 2+ Spear cards this turn, you may spend 2 Reach Advantage to make this attack unreducible by defensive effects.",
              "flavorText": "A lightning-fast thrust with perfect extension, the spear tip finding its mark before the opponent can react to the subtle movement.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-05",
              "name": "Harai",
              "subtitle": "Sweeping Technique",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 1 damage. Change to your preferred range and gain 2 Reach. If you have 3+ Reach, your opponent cannot change range on their next turn.",
              "masterEffect": "If you've played 2+ Spear cards this turn, also force your opponent to exit their current stance.",
              "flavorText": "The spear sweeps in a wide arc, simultaneously creating distance while disrupting the opponent's position and balance.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-06",
              "name": "Kaeshi",
              "subtitle": "Redirecting Thrust",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Deal 2 damage. You may spend 2 Reach to change range after this attack resolves. While at Far Range with 3+ Reach, this attack deals +1 damage.",
              "masterEffect": "If you've played 2+ Spear cards this turn, if you change to Far Range, this attack deals +2 damage.",
              "flavorText": "A deceptive thrust that begins as one attack before smoothly transitioning into another, allowing perfect distance control throughout the sequence.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-07",
              "name": "Sune-kake",
              "subtitle": "Shaft Block",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and gain 1 Reach Advantage. If at Far Range, also change to Close Range.",
              "masterEffect": "If you've played 2+ Spear cards this turn, also deal 1 damage to your opponent.",
              "flavorText": "The spear shaft intercepts the incoming attack, allowing the warrior to slide forward along the weapon to close distance with perfect timing.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-08",
              "name": "Ashi-sabaki",
              "subtitle": "Footwork Mastery",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Gain 2 Reach. Change range if desired. Your next Spear card costs 1 less to play this turn. If you have 4+ Reach, you control range changes until your next turn (your opponent must spend +2 energy to change range).",
              "masterEffect": "If you've played 2+ Spear cards this turn, also draw a card if you're at your preferred range.",
              "flavorText": "The spear wielder shifts position with masterful footwork, controlling the engagement distance with subtle movements that create perfect striking opportunities.",
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-L1",
              "name": "Ancestral Thrust",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. If at Far Range, deal +2 damage. You may spend any amount of Reach Advantage to add that much additional damage. This attack cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, change to Close Range and take 1 damage.",
              "flavorText": "The perfect thrust handed down through generations, combining power and precision that few can match, though the extension leaves your aging body momentarily vulnerable.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-L2",
              "name": "Elder's Zone Control",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Gain 4 Reach Advantage immediately. Change to Far Range. All your opponents' attacks cost +1 energy until your next turn.",
              "drawback": "You cannot change stance until the end of your next turn.",
              "flavorText": "Decades of practice allow perfect zone control that transcends conscious thought, though maintaining such mastery taxes your weathered body's flexibility.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "SP-L3",
              "name": "Generational Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Generational Defense stance. While in this stance, when attacked, gain 2 Reach Advantage and change to your preferred range. Reduce damage by 1 at Far Range.",
              "drawback": "Each time you change range while in this stance, discard a card.",
              "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though each movement now requires greater sacrifice as you age.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  },
  "Thrown Weapons": {
      "styleName": "Thrown Weapons",
      "styleDescription": "A tactical ranged fighting style based on historical throwing techniques, featuring resource management, strategic positioning, and sustained pressure from multiple projectiles.",
      "styleType": "Martial",
      "rangePreference": "Far Range",
      "historicalInspiration": "This style draws from diverse historical throwing weapon traditions across cultures, including Roman plumbata (weighted darts), Norse casting spears, Japanese shuriken-jutsu, Native American tomahawk techniques, and African throwing knives. The arsenal management system reflects the historical reality of weapon retrieval and conservation in combat. Many ancient and medieval warriors carried multiple throwing weapons as part of their equipment, using them strategically before closing to melee range, or maintaining distance with a constant barrage of projectiles.",
      "cards": [
          {
              "id": "TW-01",
              "name": "Barrage Position",
              "subtitle": "Volley Stance",
              "type": "Stance",
              "stanceType": "Aggressive",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Enter the Barrage Position stance. While in this stance, add 1 to your Arsenal when you deal damage with a Thrown Weapons attack.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, your attacks cost -1 energy for each 3 Arsenal you have.",
              "flavorText": "The thrower arranges multiple weapons for quick access, creating a deadly zone where each throw is immediately followed by another.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-02",
              "name": "Defensive Array",
              "subtitle": "Counter Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Defensive Array stance. While in this stance, when attacked, you may spend 2 Arsenal to reduce damage by 2.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also deal 1 damage to your opponent when you reduce damage this way.",
              "flavorText": "Weapons held at the ready between fingers, allowing for instant defensive throws to intercept incoming attacks before they land.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-03",
              "name": "Mobile Thrower",
              "subtitle": "Skirmisher Stance",
              "type": "Stance",
              "stanceType": "Evasive",
              "cost": 1,
              "focusDie": "d8",
              "effect": "Enter the Mobile Thrower stance. While in this stance, you may change to Far Range for 0 energy once per turn and add 1 to your Arsenal when you do.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also draw a card when you change to Far Range.",
              "flavorText": "Light on their feet, these fighters excel at maintaining optimal distance, retrieving weapons as they move with fluid grace.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-04",
              "name": "Plumbata Volley",
              "subtitle": "Weighted Darts",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. If at Far Range, deal +1 damage. Add 1 to your Arsenal. Spend 2 Arsenal: Attack again with -1 damage.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, you may spend 3 Arsenal to have this attack deal double damage.",
              "flavorText": "A flurry of weighted darts hurled in rapid succession, their lead weights giving them devastating armor-piercing power.",
              "rangeRestriction": "Far Range Only"
          },
          {
              "id": "TW-05",
              "name": "Chakram Throw",
              "subtitle": "Circular Blade",
              "type": "Attack",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Deal 1 damage. You may spend 2 Arsenal to have this attack strike again for 1 additional damage. Spend 2 Arsenal: Attack again with -1 damage.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, you may spend 2 more Arsenal to strike a third time.",
              "flavorText": "The circular throwing blade curves through the air on a controlled path, potentially striking multiple targets before returning to the thrower's hand.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-06",
              "name": "Francisca Axe",
              "subtitle": "Heavy Throwing Axe",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d8",
              "effect": "Deal 3 damage. Spend X Arsenal: This attack deals +X damage. If you spend 4+ Arsenal, this attack cannot be reduced by defensive effects. Spend 2 Arsenal: Attack again with -1 damage.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also force your opponent to exit their current stance.",
              "flavorText": "The heavy throwing axe spins with devastating force, its weighted head designed to crush shields and armor alike.",
              "rangeRestriction": "Far Range Only"
          },
          {
              "id": "TW-07",
              "name": "Intercept Throw",
              "subtitle": "Defensive Counter",
              "type": "Reaction",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and deal 1 damage to your opponent. Add 1 to your Arsenal.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also change to Far Range if desired.",
              "flavorText": "A perfectly timed throw meets the opponent's attack mid-flight, deflecting their weapon while continuing onward to strike true.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-08",
              "name": "Gather Arsenal",
              "subtitle": "Resupply",
              "type": "Technique",
              "cost": 1,
              "focusDie": "d4",
              "effect": "Add 3 to your Arsenal. Your next Thrown Weapons attack costs 1 less to play this turn. If you have 5+ Arsenal, you may make an additional attack this turn by spending 3 Arsenal.",
              "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also draw a card for every 4 Arsenal you have.",
              "flavorText": "The fighter quickly retrieves spent weapons or produces hidden ones from various sheaths and pouches, preparing for the next barrage.",
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-L1",
              "name": "Ancestral Barrage",
              "subtitle": "Legacy Attack",
              "type": "Attack",
              "cost": 3,
              "focusDie": "d10",
              "effect": "Deal 2 damage. You may spend any amount of Arsenal to add that much additional damage. If at Far Range, this attack cannot be reduced by defensive effects.",
              "drawback": "After this attack resolves, remove half your Arsenal (rounded up) and take 1 damage.",
              "flavorText": "The culmination of generations of throwing mastery, a devastatingly precise volley that strains aging joints with each perfect throw.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-L2",
              "name": "Elder's Preparation",
              "subtitle": "Legacy Technique",
              "type": "Technique",
              "cost": 2,
              "focusDie": "d8",
              "effect": "Add 6 to your Arsenal. Draw 2 cards. Your next Thrown Weapons attack costs 2 less energy to play.",
              "drawback": "Skip your Draw phase next turn and discard a card from your hand.",
              "flavorText": "Decades of combat experience allow for masterful preparation, though summoning such focus now takes a heavy toll on your weathered mind.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          },
          {
              "id": "TW-L3",
              "name": "Generational Defense",
              "subtitle": "Legacy Stance",
              "type": "Stance",
              "stanceType": "Defensive",
              "cost": 2,
              "focusDie": "d6",
              "effect": "Enter the Generational Defense stance. While in this stance, when attacked, you may spend 2 Arsenal to negate the attack completely. If at Far Range, add 2 to your Arsenal at the start of your turn.",
              "drawback": "While in this stance, you cannot have more than 8 Arsenal at any time.",
              "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though your aging body limits the number of weapons you can ready at once.",
              "isLegacy": true,
              "rangeRestriction": "Any"
          }
      ]
  }
}