{
  "styleName": "Arcane Magic",
  "styleDescription": "An adaptive, resource-conversion style focused on technical versatility and tactical adaptation, featuring mana manipulation and spell modification techniques.",
  "styleType": "Magical",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "Arcane Magic draws from scholarly magical traditions across cultures. Western influences include John Dee's 'Monas Hieroglyphica' (1564) on symbolic manipulation, Cornelius Agrippa's 'De Occulta Philosophia' (1533) which systematized magical correspondences, and the Hermetic 'Liber Mutationis' (c. 1670) detailing energy transmutation methods. Eastern sources include the Chinese 'Lingbao Wuxing' (靈寶五行, 4th century) on five-element transformations, Japanese 'Onmyōdō' texts like 'Senji Ryakketsu' (占事略決, 13th century) describing energy manipulation, and the Indian 'Siddhānta' mathematical-magical treatises that formalized pattern magic. The Mana resource mechanic parallels concepts from both Western alchemical principles of the 'quinta essentia' as described in Paracelsus' 'Archidoxis Magica' (1575) and Eastern theories of 'qi transformation' detailed in the Daoist 'Neidan' (內丹) inner alchemy texts, representing the fundamental magical energy that can be converted between different forms and applications.",
  "cards": [
    {
      "id": "AM-01",
      "name": "Arcane Focus",
      "subtitle": "Energy Concentration",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Arcane Focus stance. While in this stance, gain 1 Mana at the beginning of your turn and whenever you play a Technique card.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, you may convert 2 Mana into 1 energy when playing cards.",
      "flavorText": "The practitioner adopts a meditative posture with precise hand gestures, establishing optimal energy pathways to accumulate and refine magical energy for subsequent techniques.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-02",
      "name": "Arcane Assault",
      "subtitle": "Energy Projection",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Arcane Assault stance. While in this stance, you may spend 2 Mana to add 1 damage to your attacks.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, reduce the Mana cost to 1 instead of 2.",
      "flavorText": "The arcanist positions their hands in precise offensive formations, creating efficient channels for projecting concentrated magical energy with minimal dissipation.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-03",
      "name": "Mystic Displacement",
      "subtitle": "Spatial Shift",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Mystic Displacement stance. While in this stance, you may spend 2 Mana to change range as a free action once per turn.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, gain 1 Mana when you change range this way.",
      "flavorText": "Through a series of subtle gestures, the arcane practitioner manipulates local spatial properties, allowing rapid repositioning with minimal physical movement.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-04",
      "name": "Arcane Missile",
      "subtitle": "Guided Projectile",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend up to 3 Mana to add that much additional damage.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, draw a card after this attack resolves.",
      "flavorText": "A carefully formulated energy construct launches toward the target, its trajectory and intensity precisely controlled through established arcane formulas.",
      "rangeRestriction": "Far Range Only"
    },
    {
      "id": "AM-05",
      "name": "Arcane Surge",
      "subtitle": "Power Concentration",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Mana. Your next Arcane Magic card costs 1 less energy to play this turn.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, gain 5 Mana instead of 3.",
      "flavorText": "The practitioner rapidly gathers ambient magical energy through efficient collection techniques, condensing it into a stable, usable form for immediate application.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-06",
      "name": "Spell Modification",
      "subtitle": "Arcane Adaptation",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Spend 2 Mana: Look at the top 3 cards of your deck. Put one into your hand and the rest on the bottom of your deck in any order.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, look at the top 5 cards instead of 3.",
      "flavorText": "Through precise manipulation of fundamental magical principles, the arcanist adapts their prepared spells to better suit the current tactical situation.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-07",
      "name": "Counterspell",
      "subtitle": "Magical Disruption",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Play when your opponent plays a card. Spend 3 Mana: Cancel that card's effects.",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, spend only 2 Mana instead of 3.",
      "flavorText": "The arcanist quickly identifies the magical structure of an incoming spell and applies precisely calculated interference patterns to collapse it harmlessly.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-08",
      "name": "Mana Conversion",
      "subtitle": "Energy Transmutation",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Spend any amount of Mana. Draw cards equal to half the Mana spent (rounded up).",
      "masterEffect": "If you've played 2+ Arcane Magic cards this turn, also gain 1 energy for each card drawn this way.",
      "flavorText": "Through advanced energy manipulation techniques, the arcanist transforms raw magical energy into enhanced cognitive processing, accelerating tactical analysis.",
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-L1",
      "name": "Ancestral Formula",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d12",
      "effect": "Deal 2 damage. Spend any amount of Mana to add that much additional damage. This attack cannot be reduced by defensive effects or responded to with reactions.",
      "drawback": "After this attack resolves, lose all remaining Mana and take 1 damage for each 3 Mana lost this way (rounded up).",
      "flavorText": "This perfected arcane sequence passed down through generations creates an unavoidable force projection, though the complex formulae strain both mind and body as the caster's energy channels deplete.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-L2",
      "name": "Generational Insight",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain 5 Mana immediately. Look at your opponent's hand. Your next 2 Arcane Magic cards each cost 1 less energy to play.",
      "drawback": "Skip your next Focus phase. You cannot play reaction cards until your next turn.",
      "flavorText": "Drawing upon accumulated arcane knowledge of countless predecessors provides exceptional tactical clarity, though channeling such expansive cognition temporarily limits the caster's ability to gather and respond to new information.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "AM-L3",
      "name": "Arcane Mastery",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Enter the Arcane Mastery stance. While in this stance, gain 2 Mana at the beginning of your turn. Whenever you would spend Mana, spend 1 less Mana (minimum 1) and double the effect.",
      "drawback": "While in this stance, whenever you gain energy from Focus dice, reduce that energy by 1 (minimum 0).",
      "flavorText": "The ultimate expression of arcane efficiency perfected through generations, allowing unprecedented magical amplification through optimized energy pathways, though maintaining such precise control reduces the practitioner's ability to process raw power sources.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}