{
  "styleName": "Earth Magic",
  "styleDescription": "A defensive, territorial control style focusing on stability, endurance, and battlefield manipulation through the element of earth.",
  "styleType": "Magical",
  "rangePreference": "Close Range",
  "historicalInspiration": "Earth Magic draws from codified magical traditions in both Eastern and Western esoteric texts. Its foundations appear in Heinrich Cornelius Agrippa's 'De Occulta Philosophia' (1533) which systematized elemental correspondences, and later in Francis Barrett's 'The Magus' (1801) which detailed earth element invocations. Eastern influences include the earth-manipulation techniques found in the Chinese 'Classic of Mountains and Seas' (山海经, 4th century BCE) and Japanese Onmyōdō earth-alignment practices documented in the 'Senji Ryakketsu' (占事略決, 13th century). The stability resource mechanic mirrors concepts from the medieval alchemical text 'Splendor Solis' (1532-1535) which describes the gradual fixation of the earth element through repeated operations. While obviously fantastical, the style presents earth magic as a disciplined tradition with established techniques, stances, and methodologies that would be studied and refined by practitioners over generations, similar to how martial arts developed formal schools and transmission methods.",
  "cards": [
    {
      "id": "EM-01",
      "name": "Stone Skin",
      "subtitle": "Protective Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Stone Skin stance. While in this stance, reduce damage from attacks by 1 and gain 1 Stability after reducing damage.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, also gain 1 Stability when you enter this stance.",
      "flavorText": "The mage's skin hardens to stone, each attack chipping away harmlessly as their connection to the earth deepens.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-02",
      "name": "Seismic Stance",
      "subtitle": "Aggressive Tremor",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Seismic Stance. While in this stance, spend 2 Stability: your next attack deals +2 damage this turn.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, reduce the Stability cost to 1.",
      "flavorText": "The earth mage channels tremors through their body, each footfall sending destabilizing shockwaves toward their opponent.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-03",
      "name": "Shifting Sands",
      "subtitle": "Evasive Terrain",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Shifting Sands stance. While in this stance, when an opponent changes range, gain 2 Stability.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, you may spend 3 Stability to change range after an opponent's attack resolves.",
      "flavorText": "The ground beneath becomes fluid and unpredictable, responsive to the mage's will while betraying the footsteps of enemies.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-04",
      "name": "Stone Spike",
      "subtitle": "Piercing Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend any amount of Stability to add that much additional damage.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, gain 2 Stability after this attack resolves.",
      "flavorText": "A jagged spear of stone erupts from the ground, its force and trajectory guided by the mage's accumulated earth energy.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-05",
      "name": "Crushing Boulder",
      "subtitle": "Heavy Impact",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Deal 3 damage. If you have 4+ Stability, this attack cannot be reduced by defensive effects.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, force your opponent to exit their current stance.",
      "flavorText": "A massive rock materializes above the opponent, its crushing weight impossible to deflect through conventional means.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "EM-06",
      "name": "Earth Wall",
      "subtitle": "Defensive Barrier",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 2 and gain 1 Stability.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, gain 2 additional Stability.",
      "flavorText": "A solid wall of stone and soil erupts from the ground, absorbing the impact of the attack while reinforcing the mage's connection to the earth.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-07",
      "name": "Quicksand Trap",
      "subtitle": "Terrain Control",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Your opponent cannot change range during their next turn. Gain 2 Stability.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, also deal 1 damage for each 3 Stability you have.",
      "flavorText": "The ground becomes treacherous and grasping, holding enemies in place while they struggle fruitlessly to escape.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-08",
      "name": "Tectonic Shift",
      "subtitle": "Ground Force",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Stability. Your next Earth Magic card costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Earth Magic cards this turn, also change range if desired.",
      "flavorText": "The earth mage realigns the very bedrock beneath their feet, channeling the ancient power of stone into their next spell.",
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-L1",
      "name": "Ancestral Mountain",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Enter the Ancestral Mountain stance. While in this stance, reduce all damage by 2 and gain 2 Stability when attacked. Spend 4 Stability: Negate an attack completely.",
      "drawback": "While in this stance, you cannot change range and your attacks cost +1 energy.",
      "flavorText": "The perfect defensive technique passed down through generations, becoming one with the mountains themselves, though your aging body bears the weight of stone with increasing difficulty.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "EM-L2",
      "name": "Elder's Earthquake",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 4,
      "focusDie": "d12",
      "effect": "Deal 3 damage. You may spend any amount of Stability to add that much additional damage. This attack cannot be reduced by defensive effects and forces your opponent to exit their stance.",
      "drawback": "After this attack resolves, lose all remaining Stability and take 2 damage.",
      "flavorText": "The devastating earth technique refined across generations, channeling the raw power of tectonic forces, though the strain of such power tears at your weathered body.",
      "isLegacy": true,
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "EM-L3",
      "name": "Generational Resonance",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain 6 Stability immediately. All your Earth Magic cards cost 1 less energy to play until the end of your next turn.",
      "drawback": "At the end of your next turn, lose half your health (rounded down).",
      "flavorText": "The accumulated earth magic wisdom of your ancestors flows through your veins, though harnessing such primal power exacts a heavy toll on your aging frame.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}