{
  "styleName": "Fire Magic",
  "styleDescription": "An aggressive, destructive style focused on overwhelming offense and damage over time, featuring heat building mechanics and devastating area effects that grow in power.",
  "styleType": "Magical",
  "rangePreference": "Far Range",
  "historicalInspiration": "Fire Magic draws from pyromantic traditions documented across numerous historical esoteric texts. Western influences include Heinrich Cornelius Agrippa's work on salamanders and fire elementals in 'De Occulta Philosophia' (1533), Trithemius' 'Steganographia' (c. 1500) on flame divination, and the detailed fire invocations in the 'Grimoire of Pope Honorius' (13th century). Eastern inspirations include the Taoist 'fire refinement' methods described in the 'Huang-Lao' texts (黄老, c. 2nd century BCE), Japanese 'Hi-jutsu' fire techniques documented in the 'Bansenshukai' ninja scrolls (萬川集海, 1676), and the Indian Agni Vidya practices outlined in the 'Agnipurana' (अग्निपुराण, c. 8th-11th century). The Heat resource mechanic parallels concepts found in both Western alchemical texts on the 'caloric' theory of heat as documented in Antoine Lavoisier's 'Traité Élémentaire de Chimie' (1789) and the Chinese Wu Xing theory of fire as an accumulating and transformative force described in the 'Huainanzi' (淮南子, 2nd century BCE).",
  "cards": [
    {
      "id": "FM-01",
      "name": "Conflagration Stance",
      "subtitle": "Burning Aura",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d10",
      "effect": "Enter the Conflagration Stance. While in this stance, gain 1 Heat at the beginning of your turn and whenever you play an attack card.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, immediately gain 2 Heat upon entering this stance.",
      "flavorText": "The pyromancer's body becomes wreathed in dancing flames, the air around them shimmering with intense heat that grows more dangerous by the moment.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-02",
      "name": "Ember Shield",
      "subtitle": "Protective Flames",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Ember Shield stance. While in this stance, when attacked, you may spend 2 Heat to deal 2 damage to your attacker.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, reduce damage by 1 while in this stance.",
      "flavorText": "Swirling cinders orbit the mage like a living armor, lashing out to burn any who dare approach too closely.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-03",
      "name": "Smoke Form",
      "subtitle": "Ashen Escape",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Smoke Form stance. While in this stance, the first time you would take damage each turn, reduce that damage by 1 and gain 1 Heat.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, you may change range as a free action once per turn.",
      "flavorText": "The fire mage's body partially dissipates into swirling smoke, making them difficult to strike while fueling their inner flame with each evasion.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-04",
      "name": "Fireball",
      "subtitle": "Explosive Projectile",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend up to 3 Heat to add that much additional damage to this attack.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, your opponent cannot reduce this damage with defensive effects.",
      "flavorText": "A condensed sphere of roaring flame streaks through the air before detonating with concussive force, its intensity fueled by the caster's internal heat.",
      "rangeRestriction": "Far Range preferred"
    },
    {
      "id": "FM-05",
      "name": "Burning Touch",
      "subtitle": "Lingering Flames",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage. Your opponent takes 1 additional damage at the beginning of their next turn. Gain 1 Heat.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, the lingering damage increases to 2.",
      "flavorText": "The pyromancer's touch leaves flames that cling to their opponent, hungrily consuming flesh long after the initial contact.",
      "rangeRestriction": "Close Range only"
    },
    {
      "id": "FM-06",
      "name": "Flame Surge",
      "subtitle": "Heat Release",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Spend all Heat. Deal damage equal to half the Heat spent (rounded up). Draw a card.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, deal damage equal to all Heat spent instead of half.",
      "flavorText": "The mage channels their accumulated heat into a sudden eruption of flame, the release creating space for new tactical possibilities.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-07",
      "name": "Flame Ward",
      "subtitle": "Retaliatory Barrier",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when attacked. Reduce damage by 2. For each damage prevented this way, gain 1 Heat.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, also deal 2 damage to your attacker.",
      "flavorText": "A wall of intense flame materializes just as the attack lands, absorbing the blow and converting its energy into fuel for the pyromancer's next assault.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-08",
      "name": "Kindle",
      "subtitle": "Stoke the Flames",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Heat. Your next Fire Magic card costs 1 less energy to play this turn.",
      "masterEffect": "If you've played 2+ Fire Magic cards this turn, also deal 1 damage to your opponent.",
      "flavorText": "The mage focuses inward, stoking their internal flame to dangerous levels in preparation for a devastating release of power.",
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-L1",
      "name": "Ancestral Inferno",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 4,
      "focusDie": "d12",
      "effect": "Deal 3 damage. Spend any amount of Heat to add that much additional damage. Your opponent takes 2 additional damage at the beginning of their next turn.",
      "drawback": "Take damage equal to half the Heat spent (rounded up). Your Heat is reduced to 0 after this attack resolves.",
      "flavorText": "The ultimate fire technique passed through your bloodline unleashes devastating power, but the strain of channeling such intense heat scorches your aging body from within.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-L2",
      "name": "Generational Pyre",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Immediately gain 5 Heat. Until the end of your next turn, your Fire Magic attacks deal +1 damage and cost 1 less energy to play.",
      "drawback": "You cannot use reactions until your next turn. At the beginning of your next turn, lose 2 health.",
      "flavorText": "Drawing upon the collective pyromantic knowledge of your ancestors creates an overwhelming surge of power that threatens to consume you from within.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "FM-L3",
      "name": "Elder's Immolation",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Enter the Elder's Immolation stance. While in this stance, gain 2 Heat at the beginning of your turn. When you deal damage, add your current Heat to the damage (up to a maximum of +5).",
      "drawback": "At the end of each of your turns while in this stance, take damage equal to half your current Heat (rounded up).",
      "flavorText": "The culmination of generations of fire magic manifests as flames that burn with unnatural intensity, granting immense power at the cost of consuming the caster from within.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}