{
  "styleName": "Lightning Magic",
  "styleDescription": "A fast, reactive fighting style focused on chain reactions, burst damage, and rapid strikes, featuring charge accumulation and devastating electrical attacks.",
  "styleType": "Magical",
  "rangePreference": "Far Range",
  "historicalInspiration": "Lightning Magic draws from both experimental electrical studies and esoteric traditions. Western influences include Giambattista della Porta's 'Magia Naturalis' (1558) which documented early electrical phenomena, Benjamin Franklin's 'Experiments and Observations on Electricity' (1751), and the Hermetic Order of the Golden Dawn's 'Liber Fulguris' (c. 1890s) containing thunder invocation rituals. Eastern sources include the Japanese 'Raijin-ki' (雷神記, c. 15th century) detailing thunder god ceremonies, Chinese 'Lei Shu' (雷書, Song Dynasty) on controlling celestial electricity, and Tibetan 'glog-'khor' (lightning wheel) practices described in the 'rGyud-bzhi' medical texts. The Charge resource mechanic reflects concepts from both Franz Mesmer's 'animal magnetism' theory (1775) and the Chinese 'shen-dian' (神電, divine lightning) energy described in Daoist alchemical texts. This style's focus on rapid bursts and chain reactions mirrors early scientific understanding of electrical capacitance as documented in Luigi Galvani's work (1780s) and Eastern concepts of lightning as accumulated yang energy seeking sudden release.",
  "cards": [
    {
      "id": "LM-01",
      "name": "Conduction Stance",
      "subtitle": "Energy Channel",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Conduction Stance. While in this stance, gain 1 Charge when you play a card. When your Charge reaches 5 or more, your next attack deals +2 damage.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, immediately gain 2 Charge upon entering this stance.",
      "flavorText": "The mage's body crackles with electrical potential, each movement generating new currents that build toward an inevitable discharge.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-02",
      "name": "Faraday Shell",
      "subtitle": "Protective Field",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Faraday Shell stance. While in this stance, when attacked, you may spend 2 Charge to reduce damage by 2.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, also gain 1 Charge when you reduce damage this way.",
      "flavorText": "Electrical energy forms a protective cage around the mage, redirecting incoming attacks safely into the ground.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-03",
      "name": "Plasma Form",
      "subtitle": "Ionized Escape",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Plasma Form stance. While in this stance, you may spend 3 Charge to change range as a free action.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, when changing range this way, also deal 1 damage to your opponent.",
      "flavorText": "The lightning mage partially transforms into pure energy, capable of instantly relocating in a flash of blinding light.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-04",
      "name": "Lightning Bolt",
      "subtitle": "Direct Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend up to 4 Charge to add that much additional damage to this attack.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, this attack cannot be reduced by defensive effects.",
      "flavorText": "A concentrated lance of electrical energy arcs toward the opponent, its power amplified by the mage's accumulated charge.",
      "rangeRestriction": "Far Range Only"
    },
    {
      "id": "LM-05",
      "name": "Chain Lightning",
      "subtitle": "Arcing Energy",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage. If you have 3+ Charge, deal 1 additional damage and gain 1 Charge.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, if you have 6+ Charge, deal 2 additional damage instead.",
      "flavorText": "Electricity jumps between multiple points, creating a devastating network of energy that feeds back into the caster's power reserves.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-06",
      "name": "Overload",
      "subtitle": "Energy Release",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Spend all Charge. Deal damage equal to half the Charge spent (rounded up). Draw a card.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, deal damage equal to all Charge spent instead of half.",
      "flavorText": "The mage releases all accumulated electrical energy in a single explosive discharge, creating momentary clarity in the aftermath.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-07",
      "name": "Shock Field",
      "subtitle": "Area Denial",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent changes range or stance. Deal 1 damage and gain 2 Charge.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, also prevent your opponent's range or stance change.",
      "flavorText": "A sudden burst of electrical energy fills the area, painfully disrupting the opponent's movement and feeding the mage's power reserves.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-08",
      "name": "Static Build",
      "subtitle": "Charge Accumulation",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Charge. Your next Lightning Magic card costs 1 less energy to play this turn.",
      "masterEffect": "If you've played 2+ Lightning Magic cards this turn, gain 5 Charge instead of 3.",
      "flavorText": "The air around the mage becomes charged with potential energy, hair standing on end and small sparks dancing across their fingertips.",
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-L1",
      "name": "Ancestral Thunderbolt",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d12",
      "effect": "Deal 2 damage. Spend any amount of Charge to add that much additional damage. If you spend 5+ Charge, this attack affects all ranges and cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, you cannot gain Charge until the end of your next turn.",
      "flavorText": "The perfect lightning technique passed down through your lineage channels the raw power of a thunderstorm, though the strain temporarily burns out your ability to gather new energy.",
      "isLegacy": true,
      "rangeRestriction": "Far Range Only (unless modified)"
    },
    {
      "id": "LM-L2",
      "name": "Generational Current",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Immediately gain 6 Charge. All your Lightning Magic cards cost 1 less energy to play until the end of your next turn.",
      "drawback": "At the beginning of your next turn, lose health equal to half your current Charge (rounded up).",
      "flavorText": "Drawing upon your ancestors' accumulated understanding of electrical energies grants tremendous power, though your aging body struggles to contain such potent forces.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "LM-L3",
      "name": "Elder's Storm",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Enter the Elder's Storm stance. While in this stance, gain 2 Charge at the beginning of your turn. Your attacks cost -1 energy for each 4 Charge you have (minimum 1).",
      "drawback": "While in this stance, you can't have more than 10 Charge. At the end of each turn, take damage equal to your current Charge divided by 4 (rounded up).",
      "flavorText": "The ultimate lightning technique refined over generations manifests as a perpetual storm around your body, granting tremendous power that slowly burns through your weathered frame.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}