{
  "styleName": "Shadow Magic",
  "styleDescription": "A deceptive, control-oriented fighting style focusing on information manipulation, misdirection, and devastating surprise strikes that exploit opponent vulnerabilities.",
  "styleType": "Magical",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "Shadow Magic draws from esoteric traditions focused on darkness, illusion, and hidden knowledge. Western influences include the shadow-working techniques in Johannes Trithemius' 'Steganographia' (1499), Athanasius Kircher's 'Ars Magna Lucis et Umbrae' (1646) on light and shadow manipulation, and the Rosicrucian 'Umbratorum Codex' (c. 1720) detailing shadow projection methods. Eastern sources include the Japanese 'Inton-jutsu' (隠遁術) techniques documented in the 'Bansenshukai' ninja scrolls (1676), the Chinese 'Yin Shu' (陰術, Ming Dynasty) on shadow essence cultivation, and the Tibetan 'grib-gnon' (shadow-suppression) practices in 'Yangtig Nagpo' (ཡང་ཐིག་ནག་པོ་) tantric texts. The Shroud resource mechanic parallels concepts from both Western umbramancy as described in Cornelius Agrippa's 'De Occulta Philosophia' (1533) and the Chinese 'yin-qi' (陰氣) theories of shadow energy accumulation found in Daoist inner alchemy traditions.",
  "cards": [
    {
      "id": "SM-01",
      "name": "Umbral Veil",
      "subtitle": "Concealing Stance",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Umbral Veil stance. While in this stance, when your opponent plays a card, gain 1 Shroud.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, your opponent must reveal the next card they draw.",
      "flavorText": "The practitioner manipulates ambient shadows to obscure their movements and stance, creating multiple false silhouettes that make accurate targeting nearly impossible.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-02",
      "name": "Shadow Armor",
      "subtitle": "Protective Darkness",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Shadow Armor stance. While in this stance, you may spend 2 Shroud to reduce damage from an attack by 2.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also gain 1 Shroud when you reduce damage this way.",
      "flavorText": "Concentrated shadow energy forms a protective layer around the caster's body, absorbing impacts and dissipating their force before they can cause full damage.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-03",
      "name": "Dusk Hunter",
      "subtitle": "Predatory Stance",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Dusk Hunter stance. While in this stance, your attacks deal +1 damage if you have 3+ Shroud when the attack resolves.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, your attacks also cannot be reduced by defensive effects if you have 5+ Shroud.",
      "flavorText": "The shadow practitioner assumes a low, coiled stance, using accumulated shadow energy to mask their movements until the precise moment to launch a devastating surprise attack.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-04",
      "name": "Tenebrous Strike",
      "subtitle": "Umbral Assault",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend up to 3 Shroud to add that much additional damage to this attack.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, the opponent must discard a card if this attack deals 4+ damage.",
      "flavorText": "A focused projection of shadow energy launches from an unexpected direction, its impact amplified by the caster's accumulated shadow reserves.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-05",
      "name": "Nightmare Visage",
      "subtitle": "Fear Induction",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage. Your opponent reveals their hand. Gain 1 Shroud for each stance card in their hand.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also gain 1 Shroud for each attack card in their hand.",
      "flavorText": "The caster momentarily distorts their own features into disorienting patterns using shadow techniques, causing momentary psychological shock that reveals the opponent's tactical intentions.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-06",
      "name": "Obscuring Mist",
      "subtitle": "Vision Denial",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Gain 3 Shroud. Your opponent must play with their hand revealed until they change stance.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also look at the top 3 cards of your opponent's deck and place them back in any order.",
      "flavorText": "A carefully crafted field of shadow particles disrupts the opponent's visual perception, creating blind spots and false images while the caster retains perfect awareness.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-07",
      "name": "Shadow Step",
      "subtitle": "Umbral Teleport",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Spend 2 Shroud to negate that attack and change range.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, also deal 1 damage to your opponent.",
      "flavorText": "Using precise shadow manipulation techniques, the practitioner creates a momentary illusion that draws the attack while they rapidly reposition to a more advantageous location.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-08",
      "name": "Gather Darkness",
      "subtitle": "Shadow Harvest",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 2 Shroud. Draw a card. Your next Shadow Magic card costs 1 less energy to play this turn.",
      "masterEffect": "If you've played 2+ Shadow Magic cards this turn, gain 4 Shroud instead of 2.",
      "flavorText": "Through controlled breathing and precise gestures, the shadow practitioner accumulates ambient shadow energy, enhancing their capacity for subsequent shadow techniques.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-L1",
      "name": "Ancestral Eclipse",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d12",
      "effect": "Deal 2 damage. Spend any amount of Shroud to add that much additional damage. Your opponent cannot respond to this attack with reactions.",
      "drawback": "After this attack resolves, your opponent may look at your hand until the end of their next turn.",
      "flavorText": "This advanced hereditary technique temporarily blinds all observers with concentrated shadow energy, though the exceptional effort leaves the caster's guard temporarily lowered afterward.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-L2",
      "name": "Generational Darkness",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Immediately gain 5 Shroud. Look at your opponent's hand and the top 3 cards of their deck. Your Shadow Magic cards cost 1 less energy to play until your next turn.",
      "drawback": "Skip your draw phase next turn.",
      "flavorText": "This multi-generational technique enhances shadow perception to unprecedented levels, revealing hidden information but taxing the practitioner's mental resources for subsequent planning.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "SM-L3",
      "name": "Void Master's Form",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Enter the Void Master's Form stance. While in this stance, gain 2 Shroud at the beginning of your turn. When targeted by an attack, you may spend 3 Shroud to redirect that attack to deal damage to your opponent instead.",
      "drawback": "While in this stance, you must spend 1 Shroud at the end of each of your turns or take 2 damage.",
      "flavorText": "The culmination of centuries of shadow techniques allows masterful redirection of attacks through specialized shadow fields, though maintaining this advanced stance continuously drains either shadow reserves or physical stamina.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}