{
  "styleName": "Water Magic",
  "styleDescription": "An adaptive, reactive fighting style based on fluid movement and energy redirection, featuring tactical flexibility and powerful counter-techniques.",
  "styleType": "Magical",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "Water Magic draws from numerous historical esoteric and martial traditions that emphasized fluid movement and energy redirection. Western influences include Paracelsus' treatise 'De Meteoris' (1569) which detailed water elemental correspondences, and the 16th century alchemical text 'Rosarium Philosophorum' which codified water's transmutative properties. Eastern inspirations include the water manipulation techniques described in the Taoist text 'Huainanzi' (淮南子, 2nd century BCE) and the Japanese water-based divination system of Mizuura documented in 'Honchō Shokkan' (本朝食鑑, 1697). The Flow resource mechanic parallels concepts from both the medieval European 'humoral theory' of Galen and the Chinese 'Five Phase' theory where water represents adaptability and constant change. The style's mechanics of redirection and counter-techniques also draw from historical martial arts that emphasized yielding to an opponent's force, such as those documented in Chen Wangting's Taiji principles (17th century) and Japanese jūjutsu scrolls like the 'Kito-ryu Mokuroku' (起倒流目録, 18th century).",
  "cards": [
    {
      "id": "WM-01",
      "name": "Flowing Stance",
      "subtitle": "Adaptive Guard",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Flowing Stance. While in this stance, gain 1 Flow when your opponent plays a card.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, you may spend 2 Flow to draw a card.",
      "flavorText": "The water mage adopts a fluid posture, their body seeming to ripple like the surface of a pond, ready to absorb and redirect any energy sent their way.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-02",
      "name": "Crashing Wave",
      "subtitle": "Aggressive Surge",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Crashing Wave stance. While in this stance, you may spend any amount of Flow when you play an attack to add that much additional damage.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, your next attack costs 1 less energy for each 2 Flow you have (minimum 1).",
      "flavorText": "The mage gathers magical currents around them, their movements becoming powerful and directed like a wave building momentum before breaking upon the shore.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-03",
      "name": "Ice Shield",
      "subtitle": "Defensive Barrier",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Ice Shield stance. While in this stance, you may spend 2 Flow to reduce damage from an attack by 2.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, gain 1 Flow each time you reduce damage.",
      "flavorText": "Water solidifies into crystalline patterns around the mage, forming a translucent barrier that absorbs impacts before melting back into the magical current.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-04",
      "name": "Tidal Surge",
      "subtitle": "Forceful Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend any amount of Flow to add that much additional damage.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, change range after this attack resolves if desired.",
      "flavorText": "A massive wave of magical water rushes forth, its power amplified by the collected energies the mage has gathered from previous exchanges.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-05",
      "name": "Whirlpool Strike",
      "subtitle": "Disruptive Attack",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage. Your opponent must discard a Focus card. Gain 1 Flow.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, also force your opponent to exit their current stance.",
      "flavorText": "The water mage creates a swirling vortex that tears at the opponent's concentration, disrupting their carefully gathered energies.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-06",
      "name": "Waterspout",
      "subtitle": "Positional Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Deal 2 damage and change range. Gain Flow equal to the damage dealt.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, if you have 4+ Flow, this attack cannot be reduced by defensive effects.",
      "flavorText": "A column of enchanted water erupts from below, carrying both combatants to a new position while the mage harnesses the chaotic energies released.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-07",
      "name": "Redirect Current",
      "subtitle": "Defensive Counter",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and gain Flow equal to the original damage amount.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, also deal 1 damage to your opponent.",
      "flavorText": "With subtle gestures, the water mage catches the incoming force and channels it into their own reservoir of power, weakening the blow while strengthening themselves.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-08",
      "name": "Gather Currents",
      "subtitle": "Energy Collection",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Flow. Your next Water Magic card costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Water Magic cards this turn, also change stance if desired without paying its cost.",
      "flavorText": "The mage centers themselves, feeling the subtle flows of magical energy around them and drawing them inward for future use.",
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-L1",
      "name": "Ancestral Torrent",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend any amount of Flow to add that much additional damage. If you spend 4+ Flow, this attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, you cannot gain Flow until the end of your next turn.",
      "flavorText": "The perfect water technique passed down through generations, channeling destructive flood power that few can withstand, though the strain leaves your magical channels temporarily exhausted.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-L2",
      "name": "Generational Redirection",
      "subtitle": "Legacy Reaction",
      "type": "Reaction",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Play when your opponent plays an attack. Negate that attack completely and deal damage to your opponent equal to half the attack's damage (rounded up).",
      "drawback": "After this reaction resolves, discard your hand and draw 3 cards.",
      "flavorText": "The ultimate defensive technique refined through your bloodline creates a perfect mirror of water that returns harm to its source, though the spiritual exertion forces a complete reset of your tactical approach.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "WM-L3",
      "name": "Elder's Reservoir",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Gain 6 Flow immediately. All your Water Magic cards cost 1 less energy to play until the end of your next turn.",
      "drawback": "Lose 2 health when you play this card.",
      "flavorText": "Decades of practice allow you to open the deepest channels of water energy beyond what younger mages can access, though your aging body struggles to contain such power without damage.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}