{
  "styleName": "Battle Axe",
  "styleDescription": "An offense-focused fighting style based on historical Viking and medieval axe techniques, featuring momentum building and powerful cleaving attacks.",
  "styleType": "Martial",
  "rangePreference": "Close Range",
  "historicalInspiration": "The Battle Axe style draws primarily from Viking and Norse combat traditions (8th-11th centuries), as well as later medieval European battlefield axe techniques. Viking warriors were known for their devastating axe techniques that emphasized power and momentum. The style also incorporates elements from the later medieval battleaxe, which evolved as a counter to plate armor, with techniques focused on concentrating force to penetrate or damage armored opponents.",
  "cards": [
    {
      "id": "BA-01",
      "name": "Høggva",
      "subtitle": "Cleaving Stance",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d10",
      "effect": "Enter the Høggva stance. While in this stance, gain +1 Momentum when you deal damage.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, immediately gain 2 Momentum upon entering this stance.",
      "flavorText": "The warrior raises the axe high with legs braced wide apart, each swing building force for the next in a devastating chain of attacks.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Derived from Old Norse term 'höggva' meaning 'to strike/chop'. This stance reflects the aggressive overhead position commonly seen in Norse sagas and archaeological evidence of combat injuries consistent with powerful downward strikes."
    },
    {
      "id": "BA-02",
      "name": "Skjaldborg",
      "subtitle": "Shield Wall",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Skjaldborg stance. While in this stance, when attacked, you may spend 2 Momentum to reduce damage by 2.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, reduce damage by 3 instead.",
      "flavorText": "The fighter positions the axe haft to deflect incoming strikes, using the broad head to catch and redirect enemy weapons.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on the famous Viking 'shield-wall' formation (skjaldborg in Old Norse). While primarily a group tactic, individual warriors adopted similar principles, using their weapons defensively when needed."
    },
    {
      "id": "BA-03",
      "name": "Sviða",
      "subtitle": "Sweeping Guard",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d8",
      "effect": "Enter the Sviða stance. While in this stance, if an opponent's attack misses or is fully blocked, gain 1 Momentum.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, you may immediately spend Momentum to deal that much damage to your opponent.",
      "flavorText": "The warrior keeps the axe in constant motion at waist height, creating a defensive perimeter that builds energy with each successful deflection.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Inspired by the sweeping defensive movements found in later medieval pollaxe techniques, particularly those in the tradition of Le Jeu de la Hache (15th century French axe manual)."
    },
    {
      "id": "BA-04",
      "name": "Brotna",
      "subtitle": "Sunder Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d12",
      "effect": "Deal 2 damage. You may spend up to 3 Momentum to add that much additional damage.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, this attack also forces your opponent to discard a Focus card.",
      "flavorText": "The axe-wielder channels accumulated force into a single devastating overhead chop capable of splitting shields and crushing armor with sheer power.",
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "From Old Norse 'brotna' meaning 'to break'. Based on archaeological evidence of shield damage patterns and saga accounts of axes breaking through shields and armor in a single powerful blow."
    },
    {
      "id": "BA-05",
      "name": "Krækja",
      "subtitle": "Hook Pull",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage and pull your opponent into your stance advantage (if any). Gain 1 Momentum.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, also force opponent to exit their current stance.",
      "flavorText": "With practiced efficiency, the warrior hooks the axe head behind an opponent's shield or limb and violently yanks them off-balance into a vulnerable position.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on the hook (krókr in Old Norse) feature present on many Viking axe heads, specifically designed to pull enemy shields or create openings in their defense."
    },
    {
      "id": "BA-06",
      "name": "Tvíhenda",
      "subtitle": "Double-Handed Swing",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 3 damage. If you have 4+ Momentum, this attack cannot be reduced by defensive effects.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, gain Momentum equal to the damage dealt.",
      "flavorText": "Gripping the axe with both hands wide apart, the fighter delivers a sweeping arc that cuts through defenses with unstoppable centrifugal force.",
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "From Old Norse 'tvíhenda' meaning 'two-handed'. Refers to the technique of using the long-handled Dane axe with both hands, a weapon that became prominent in the late Viking Age."
    },
    {
      "id": "BA-07",
      "name": "Kasta",
      "subtitle": "Throwing Axe",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Deal 2 damage and spend all Momentum. For each Momentum spent, deal +1 damage.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, draw a card after this attack resolves.",
      "flavorText": "With split-second timing, the warrior hurls a smaller throwing axe to intercept an incoming attack, the spinning blade slicing through the air with deadly precision.",
      "rangeRestriction": "Any",
      "historicalInspiration": "From Old Norse 'kasta' meaning 'to throw'. Based on the Francisca and other throwing axes used by Norse warriors and Frankish troops. Archaeological and historical accounts confirm the practice of carrying smaller axes specifically for throwing."
    },
    {
      "id": "BA-08",
      "name": "Bylgjur",
      "subtitle": "Waves of Force",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 2 Momentum. Your next Battle Axe attack costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Battle Axe cards this turn, also draw a card for every 3 Momentum you have.",
      "flavorText": "The fighter performs a series of rhythmic feints and practice swings, each motion building kinetic energy that will be unleashed in a devastating assault.",
      "rangeRestriction": "Any",
      "historicalInspiration": "From Old Norse 'bylgja' meaning 'wave'. Based on accounts and martial theories of sequential striking patterns that build force through rhythmic movement, found in various Northern European fighting traditions."
    },
    {
      "id": "BA-L1",
      "name": "Ancestral Cleave",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 4,
      "focusDie": "d12",
      "effect": "Deal 3 damage. You may spend any amount of Momentum to add that much additional damage. This attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, lose all remaining Momentum and take 1 damage.",
      "flavorText": "The technique handed down through your bloodline harnesses generations of battle wisdom, though the strain of executing it perfectly takes its toll on your aging body.",
      "isLegacy": true,
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "Inspired by legendary berserker techniques described in Norse sagas, particularly the near-mythical accounts of warriors who could deliver devastating blows at the cost of their own well-being."
    },
    {
      "id": "BA-L2",
      "name": "Elder's Momentum",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain a Momentum immediately. Your next Battle Axe attack costs 2 less energy to play.",
      "drawback": "Skip your draw phase next turn.",
      "flavorText": "Your family's mastery of momentum has been refined across generations, though summoning such force now depletes your reserves quickly.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on accounts from various warrior cultures where techniques were refined and passed down through generations, with elders often sacrificing their own stamina to execute perfect form."
    },
    {
      "id": "BA-L3",
      "name": "Hereditary Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d10",
      "effect": "Enter the Hereditary Defense stance. While in this stance, gain 2 Momentum when attacked and reduce damage by 1.",
      "drawback": "When you exit this stance, lose 2 health.",
      "flavorText": "The defensive techniques passed down through your bloodline are devastatingly effective, though the jarring impacts reverberate through your weathered frame.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Inspired by families of weapon masters throughout history who developed their own specialized defensive techniques, particularly drawing from Norse and Germanic traditions where combat skills were considered important family inheritance."
    }
  ]
}