{
  "styleName": "Bow",
  "styleDescription": "A precision-focused ranged combat style based on historical archery techniques, featuring range advantages, tactical positioning, and calculated strikes.",
  "styleType": "Martial",
  "rangePreference": "Far Range",
  "historicalInspiration": "The Bow style draws from diverse archery traditions across multiple cultures and time periods. Primary influences include English longbow techniques (12th-16th centuries CE), which revolutionized medieval warfare; Japanese Kyudo (the 'way of the bow'), which emphasizes precision and spiritual aspects of archery; Mongolian mounted archery tactics that dominated Asian warfare for centuries; and Middle Eastern composite bow techniques that emphasized power and accuracy. The style combines tactical positioning elements with both military and hunting applications of archery throughout history.",
  "cards": [
    {
      "id": "BW-01",
      "name": "Drawn Bow",
      "subtitle": "Poised to Strike",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Drawn Bow stance. While in this stance, your attacks deal +2 damage at Far Range but you cannot change to Close Range.",
      "masterEffect": "If you've played 2+ Bow cards this turn, your next attack ignores defensive effects.",
      "flavorText": "The archer draws the bowstring to full tension, muscles locked and breathing controlled, creating the perfect platform for a devastating shot.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on the English longbow draw technique, where archers would hold their bows at full draw until commanded to loose, creating a devastating volley. This technique was notably employed at the Battle of Agincourt (1415), where English longbowmen decimated French knights. The stance also incorporates elements of Kyudo's 'kai' position, where the archer achieves complete focus at full draw."
    },
    {
      "id": "BW-02",
      "name": "Loose Stance",
      "subtitle": "Fluid Position",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Loose Stance. While in this stance, you may change range once per turn as a free action.",
      "masterEffect": "If you've played 2+ Bow cards this turn, also draw a card when changing range.",
      "flavorText": "The archer maintains a light-footed stance, constantly shifting position between shots to exploit terrain advantages and maintain optimal firing distance.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Inspired by Mongolian mounted archery techniques, where warriors would shoot while in motion, constantly adjusting their position relative to targets. Historical accounts describe Mongolian archers being able to shoot accurately while advancing, retreating, or circling their targets. The 'Parthian shot' technique (shooting while retreating) also influences this card."
    },
    {
      "id": "BW-03",
      "name": "Covered Position",
      "subtitle": "Defensive Archery",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Covered Position stance. While in this stance, reduce damage by 1. If at Far Range, reduce damage by 2 instead.",
      "masterEffect": "If you've played 2+ Bow cards this turn, opponents cannot change to Far Range unless they discard a card.",
      "flavorText": "The archer takes partial cover behind natural terrain, exposing only enough of their body to maintain line of sight while protecting vital areas.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on techniques used by English and Welsh archers who would position behind stakes or natural terrain features. Historical accounts from the Hundred Years' War describe archers exploiting terrain features for protection. Also incorporates elements from Native American hunting techniques, where hunters would use natural cover to conceal themselves from prey while maintaining line of sight."
    },
    {
      "id": "BW-04",
      "name": "Precise Shot",
      "subtitle": "Calculated Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. If at Far Range, deal 4 damage instead.",
      "masterEffect": "If you've played 2+ Bow cards this turn, your opponent cannot change range next turn.",
      "flavorText": "Taking a moment to account for distance, wind, and target movement, the archer releases a single arrow with perfect form, striking exactly as intended.",
      "rangeRestriction": "Far Range preferred",
      "historicalInspiration": "Draws from Japanese Kyudo practices, which emphasize hitting targets with a single perfect shot rather than multiple attempts. The technique also references Turkish and Persian archery traditions, where precision shooting was demonstrated through feats like splitting an arrow already in a target (documented in Ottoman archery manuals) or hitting small targets at extreme distances."
    },
    {
      "id": "BW-05",
      "name": "Rapid Volley",
      "subtitle": "Flurry of Arrows",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 1 damage. Roll your stance's focus die; deal additional damage equal to half the result (rounded up).",
      "masterEffect": "If you've played 2+ Bow cards this turn, roll the die twice and use the higher result.",
      "flavorText": "The archer's hands move in a blur, nocking and loosing arrow after arrow in rapid succession, sacrificing precision for overwhelming volume.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on the legendary speed of English longbowmen, who could reportedly loose 10-12 arrows per minute in battle. This rate of fire was demonstrated at the Battle of Crécy (1346) and other major engagements of the Hundred Years' War. The technique is also influenced by rapid-fire methods from various Asian traditions, where archers would hold multiple arrows in their draw hand."
    },
    {
      "id": "BW-06",
      "name": "Point Blank Shot",
      "subtitle": "Desperate Measure",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 3 damage if at Close Range. Then change to Far Range.",
      "masterEffect": "If you've played 2+ Bow cards this turn, also force your opponent to discard a Focus card.",
      "flavorText": "When an enemy closes in, the archer waits until the last possible moment before loosing a powerful shot at minimal distance before leaping backward.",
      "rangeRestriction": "Close Range only",
      "historicalInspiration": "Inspired by accounts from medieval battles where archers would use their bows as emergency weapons at close quarters. The technique is also influenced by Kyudo's 'hikiwake' practice, where archers shoot at extremely close range to develop proper technique. Historical evidence from English battles shows archers engaging in close combat when enemies breached their positions."
    },
    {
      "id": "BW-07",
      "name": "Tactical Retreat",
      "subtitle": "Create Distance",
      "type": "Reaction",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Play when attacked at Close Range. Change to Far Range and reduce the damage by 2.",
      "masterEffect": "If you've played 2+ Bow cards this turn, also draw a card.",
      "flavorText": "The archer executes a practiced backward roll while simultaneously nocking an arrow, creating critical distance in one fluid defensive motion.",
      "rangeRestriction": "Close Range only",
      "historicalInspiration": "Based on the 'Parthian shot' technique developed by Parthian mounted archers (247 BCE–224 CE), who would feign retreat to lure enemies into pursuit, then turn in the saddle to shoot while continuing to ride away. This tactic was later adopted by Mongol, Turkish, and other Central Asian mounted archers."
    },
    {
      "id": "BW-08",
      "name": "Nocking Draw",
      "subtitle": "Preparation",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Your next Bow attack this turn costs 1 less energy. If at Far Range, it also deals +1 damage.",
      "masterEffect": "If you've played 2+ Bow cards this turn, also change to Far Range.",
      "flavorText": "With methodical precision, the archer selects the perfect arrow and positions it on the string, the entire process optimized for the upcoming shot.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Reflects the methodical preparation emphasized in Japanese Kyudo, where the process of nocking the arrow (yazuke) is one of the eight stages of proper shooting. Also draws from medieval English training, where archers practiced to achieve maximum efficiency in nocking arrows to maintain their rate of fire in battle."
    },
    {
      "id": "BW-L1",
      "name": "Ancestral Marksman",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 4,
      "focusDie": "d12",
      "effect": "Deal 3 damage. If at Far Range, deal 5 damage instead. This attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, you cannot play any attack cards on your next turn.",
      "flavorText": "Your bloodline's centuries of archery mastery culminate in this perfect shot, though your aging joints now struggle to nock another arrow immediately after.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Inspired by legendary marksmen from various cultures, such as the Japanese master Nasuno Yoichi, who reportedly shot a fan off a pole on a moving boat during the Battle of Yashima (1184). Also draws from the feat of the Ottoman archer Tozkoparan Iskender, who could reportedly shoot an arrow over 800 meters, a record documented in Turkish archery texts."
    },
    {
      "id": "BW-L2",
      "name": "Inherited Range Mastery",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Change to Far Range. Your next two Bow attacks this turn cost 2 less energy to play and gain +1 damage.",
      "drawback": "At the end of your turn, discard all cards in your hand greater than cost 2.",
      "flavorText": "Generations of tactical positioning knowledge flow through your veins, though accessing such profound skill taxes your weathered frame.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on archery families from cultures with strong family-based training traditions, such as the samurai archer clans of feudal Japan and the Korean royal court archery families. These families developed specialized techniques passed down through generations, often with specific tactical approaches unique to their lineage."
    },
    {
      "id": "BW-L3",
      "name": "Generational Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Generational Defense stance. While in this stance, all damage taken is reduced by 2. When you're attacked, you may immediately change to Far Range.",
      "drawback": "While in this stance, your attacks cost 1 additional energy and you cannot play cards while at Close Range.",
      "flavorText": "Your ancestral defensive techniques are unmatched, having been refined through countless battles, though your aging body now requires greater distance to effectively attack.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Draws from defensive archery tactics used by steppe nomads and Mongolian horse archers, who would maintain mobile defensive formations while continuously repositioning to optimal range. Also incorporates elements from English and Welsh archery tactics during the defensive phases of battles, where maintaining distance from enemy forces was critical."
    }
  ]
}