{
  "styleName": "Longsword",
  "styleDescription": "A balanced fighting style based on historical German longsword techniques, featuring tactical stance-switching and powerful strikes.",
  "styleType": "Martial",
  "rangePreference": "Close Range",
  "historicalInspiration": "The Longsword style is primarily based on the German school of swordsmanship (Kunst des Fechtens) from the 14th-16th centuries, particularly the teachings of Johannes Liechtenauer and his successors. This martial tradition was documented in fight books (Fechtbücher) by masters like Hans Talhoffer, Sigmund Ringeck, and Joachim Meyer. The style emphasizes versatility through stance transitions, powerful strikes (Meisterhau or 'master cuts'), and a balanced approach to both offense and defense. The German longsword tradition was developed for unarmored dueling and evolved alongside developments in armor and battlefield tactics throughout the late medieval and Renaissance periods.",
  "cards": [
    {
      "id": "LS-01",
      "name": "Vom Tag",
      "subtitle": "From the Roof",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Vom Tag stance. While in this stance, your attacks deal +1 damage.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, also draw 1 card when you deal damage.",
      "flavorText": "The swordsman holds the blade high overhead, muscles coiled like a spring, ready to deliver crushing overhead blows.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Vom Tag (From the Day/Roof) is one of the four primary guards (Leger) in the German longsword tradition, documented in numerous Fechtbücher including Sigmund Ringeck's manuscript (c. 1440). The high position allows for powerful downward strikes while controlling the center line. Images from period manuscripts show fighters adopting this stance with the sword held either centrally or on the right shoulder."
    },
    {
      "id": "LS-02",
      "name": "Alber",
      "subtitle": "Fool's Guard",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Alber stance. While in this stance, reduce damage from attacks by 1.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, also force your opponent to spend +1 energy for their next attack.",
      "flavorText": "The blade points downward, tip nearly touching the ground, luring opponents into overextending their attacks through apparent vulnerability.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Alber (Fool's Guard) appears in Johannes Liechtenauer's verse glosses and is illustrated in various Fechtbücher including those by Paulus Kal and Peter von Danzig. Despite its seemingly weak position with the sword point low, it was considered deceptively powerful as it invited opponents to attack, creating opportunities for swift counters. The name suggests that only a fool would use such a seemingly vulnerable position—or that opponents are fools for attacking it."
    },
    {
      "id": "LS-03",
      "name": "Ochs",
      "subtitle": "Ox Guard",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Ochs stance. While in this stance, when attacked, you may change to a different stance immediately after damage is resolved.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, reduce the next attack's damage by 2 instead of changing stance.",
      "flavorText": "The sword is held at temple height, point aimed at the opponent's face, creating a defensive position that can instantly transition to any other guard.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Ochs (Ox) is another of the four main guards in Liechtenauer's tradition, appearing in manuscripts from the 14th-16th centuries. The sword is held at temple height with the point aimed at the opponent's face. Historical texts describe this guard as particularly good for thrusting attacks and quick transitions to other positions. It was typically practiced on both the left and right sides, as illustrated in Meyer's 1570 treatise 'Kunst des Fechtens'."
    },
    {
      "id": "LS-04",
      "name": "Zwerchhau",
      "subtitle": "Thwart Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 3 damage. If you're in an Aggressive stance, this attack cannot be reduced by defensive effects.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, also force opponent to exit their current stance.",
      "flavorText": "A powerful horizontal cut delivered with the strong of the blade, catching opponents off-guard by attacking from an unexpected angle.",
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "The Zwerchhau (Thwart Strike) is one of the five 'master cuts' (Meisterhau) in the Liechtenauer tradition. It appears in numerous manuscripts including Ringeck's and von Danzig's. This horizontal strike was executed with the hilt high and the point low, creating an unexpected angle of attack that could defeat an opponent's guard. It was particularly effective against overhead strikes, as it would simultaneously defend and attack by hitting with the strong of the blade."
    },
    {
      "id": "LS-05",
      "name": "Krumphau",
      "subtitle": "Crooked Strike",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 2 damage. If you're in a Defensive stance, draw 1 card.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, deal 3 damage instead.",
      "flavorText": "A diagonal strike that targets the opponent's hands or forearms, simultaneously deflecting their weapon while delivering a disabling cut.",
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "The Krumphau (Crooked Strike) is another of the five master cuts, documented in sources like Codex Wallerstein and Paulus Kal's Fechtbuch. This diagonal strike was specifically designed to target the opponent's hands or forearms while simultaneously displacing their blade. Period texts describe it as being delivered across the opponent's sword with a rotation of the hands, allowing the strike to come in from an unexpected angle."
    },
    {
      "id": "LS-06",
      "name": "Schielhau",
      "subtitle": "Squinting Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Deal 2 damage. If you're in an Evasive stance, change to an Aggressive stance after this attack resolves.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, this attack deals +2 damage if you change stance.",
      "flavorText": "The swordsman delivers a powerful downward cut using the false edge, breaking through the opponent's guard with deceptive angle and timing.",
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "The Schielhau (Squinting Strike) is another master cut in Liechtenauer's system, appearing in Ringeck's glosses and other period sources. It was executed with the false edge of the blade in a downward diagonal cut, designed to break through an opponent's guard. The name comes from looking 'askance' or 'squinting' at the opponent during delivery. Historical texts specifically note its effectiveness against the Pflug (Plow) guard."
    },
    {
      "id": "LS-07",
      "name": "Nachreisen",
      "subtitle": "Following After",
      "type": "Reaction",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Play when your opponent changes stance. Deal 1 damage and draw 1 card.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, also enter any stance of your choice without paying its cost.",
      "flavorText": "As the opponent shifts position, the swordsman immediately exploits the momentary vulnerability with a quick thrust to the opening created.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Nachreisen (Following After) is one of the core tactical concepts in German longsword, described in numerous Fechtbücher including Ringeck's glosses of Liechtenauer's verses. It refers to the technique of exploiting an opponent's movement or recovery by 'following after' them to attack during a moment of vulnerability. The principle teaches fighters to attack into the opponent's recovery or retreat, catching them between actions."
    },
    {
      "id": "LS-08",
      "name": "Winden",
      "subtitle": "Winding",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "If you're in a stance, you may change to any other stance. Then deal 1 damage.",
      "masterEffect": "If you've played 2+ Longsword cards this turn, negate the next stance advantage your opponent would gain against you this turn.",
      "flavorText": "The swordsman twists the blade around the opponent's weapon in a fluid motion, transitioning seamlessly from one position to another while maintaining pressure.",
      "rangeRestriction": "Any",
      "historicalInspiration": "Winden (Winding) is a fundamental concept in German longsword, extensively described in Liechtenauer's teachings and subsequent Fechtbücher. It involves rotating or 'winding' the sword during blade contact to change the angle of attack while maintaining pressure. This allowed the swordsman to seamlessly transition between guards while threatening the opponent. Historical texts describe eight primary windings (vier winden) that could be executed from the bind."
    },
    {
      "id": "LS-L1",
      "name": "Ancestral Master's Cut",
      "subtitle": "Legacy Technique",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 4 damage. If you're in a stance, this attack cannot be reduced by defensive effects.",
      "drawback": "After resolving this attack, you cannot change stance until the end of your next turn.",
      "flavorText": "Your bloodline has perfected this devastating cut through generations of refinement, though executing it now strains your battle-worn body.",
      "isLegacy": true,
      "rangeRestriction": "Close Range Only",
      "historicalInspiration": "Inspired by the lineage of German fencing masters who claimed to preserve Liechtenauer's "secret" or "hidden" techniques. Historical sources reveal that swordsmanship was often passed down through family lines, with masters guarding their most effective techniques. This card represents a perfected version of what the historical texts call a Meisterschlag (master stroke), a technique that combines elements of multiple master cuts into a single devastating attack."
    },
    {
      "id": "LS-L2",
      "name": "Inherited Wisdom",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Draw 2 cards. Your next Longsword card costs 2 less energy to play this turn.",
      "drawback": "Discard a card from your hand.",
      "flavorText": "The collected wisdom of your ancestors flows through your veins, though accessing such knowledge taxes your aging mind.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "References the concept of the fencing manuscript (Fechtbuch) tradition itself, where martial knowledge was preserved in writing for future generations. Many German masters created such texts to preserve their knowledge, often dedicating them to noble patrons. This card represents the accumulated tactical wisdom preserved in texts like the Codex Wallerstein, Gladiatoria manuscript, and von Danzig fechtbuch, which contained the collective experience of generations of swordsmen."
    },
    {
      "id": "LS-L3",
      "name": "Generational Guard",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Generational Guard stance. While in this stance, reduce all damage by 2. When an opponent attacks you, they must discard a card.",
      "drawback": "While in this stance, your attacks cost +1 energy to play.",
      "flavorText": "Your family's defensive techniques have been refined over decades, though maintaining such perfect form now requires greater effort.",
      "isLegacy": true,
      "rangeRestriction": "Any",
      "historicalInspiration": "Based on the concept of Eiserne Pforte (Iron Gate), a specialized guard described in several German fighting manuals including Peter von Danzig's manuscript. It was considered particularly strong defensively while still allowing counter-attacks. The stance combines elements of historical Eiserne Pforte with Kron (Crown), another defensive position used to catch and control an opponent's blade, creating a synthesized guard that represents generations of defensive refinement."
    }
  ]
}