{
  "styleName": "Quarterstaff",
  "styleDescription": "A balanced and versatile fighting style based on historical staff techniques, featuring excellent range transitions, positioning advantage, and adaptable combat strategies.",
  "styleType": "Martial",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "This style draws from various staff fighting traditions across cultures and eras, including English quarterstaff methods preserved in texts like Joseph Swetnam's 'The Schoole of the Noble and Worthy Science of Defence' (1617) and George Silver's 'Paradoxes of Defence' (1599). It also incorporates elements from Japanese bōjutsu, Chinese gun staff techniques, Portuguese jogo do pau, and French bâton techniques. Historically, the staff was one of the most common and accessible weapons, used by commoners and travelers for self-defense, making its techniques widespread and practical. The mechanics emphasize the historical quarterstaff's versatility in controlling distance and transitioning smoothly between offensive and defensive applications.",
  "cards": [
    {
      "id": "QS-01",
      "name": "High Ward",
      "subtitle": "Overhead Guard",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the High Ward stance. While in this stance, your attacks deal +1 damage. Each time you change range, gain 1 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to force your opponent to change stance.",
      "flavorText": "The staff is held high, ready to descend with crushing force while maintaining control of the battlefield's geometry.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-02",
      "name": "Low Ward",
      "subtitle": "Grounded Defense",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Low Ward stance. While in this stance, reduce damage from attacks by 1. After reducing damage, gain 1 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to change range after reducing damage.",
      "flavorText": "The staff is held low with one end nearly touching the ground, creating a stable defense that can quickly transition to control distance.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-03",
      "name": "Middle Guard",
      "subtitle": "Centered Stance",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Middle Guard stance. While in this stance, reduce the cost of changing range by 1 (minimum 0). When you change range, gain 2 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 3 Position to draw a card.",
      "flavorText": "The staff is held horizontally at waist height, perfectly balanced for swift transitions between advance, retreat, and lateral movement.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-04",
      "name": "Thrust Strike",
      "subtitle": "Linear Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may change range after this attack resolves. If you do, gain 2 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 3 Position to make this attack deal +2 damage.",
      "flavorText": "A powerful thrusting attack with the staff's end, perfect for controlling distance while delivering significant force.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-05",
      "name": "Sweeping Strike",
      "subtitle": "Circular Attack",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 2 damage. If you have 3+ Position, this attack cannot be reduced by defensive effects.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may change range after this attack resolves without spending energy.",
      "flavorText": "The staff whirls in a wide arc, striking with centrifugal force while clearing space for repositioning.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-06",
      "name": "Twist Strike",
      "subtitle": "Rotating Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Deal 1 damage at your current range, then change range and deal 1 additional damage. Gain 1 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, gain 2 additional Position and draw a card.",
      "flavorText": "A complex maneuver where the staff strikes before smoothly transitioning to control distance, setting up the next attack.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-07",
      "name": "Warding Parry",
      "subtitle": "Defensive Counter",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1, then change range if desired. Gain 2 Position.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, also deal 1 damage to your opponent.",
      "flavorText": "The staff intercepts the incoming attack before smoothly transitioning to control the distance, turning defense into offense in a single fluid motion.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-08",
      "name": "Flow Movement",
      "subtitle": "Positional Mastery",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Position. Change range if desired. Your next Quarterstaff card costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Quarterstaff cards this turn, you may spend 2 Position to enter any stance without paying its cost.",
      "flavorText": "The staff wielder moves with perfect economy of motion, each step and shift of weight creating optimal fighting distance and positioning.",
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-L1",
      "name": "Ancestral Combination",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage, change range, then deal 2 more damage. You may spend any amount of Position to add that much additional damage to the second strike.",
      "drawback": "After this attack resolves, lose all remaining Position and skip your next Focus phase.",
      "flavorText": "The perfect combination handed down through generations, a devastating sequence that few can withstand, though the strain on aging joints is evident in your follow-through.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-L2",
      "name": "Elder's Positioning",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain 5 Position immediately. Change range. Your next two Quarterstaff cards each cost 1 less to play this turn.",
      "drawback": "You cannot change stance until the end of your next turn.",
      "flavorText": "Decades of practice allow perfect positioning that transcends conscious thought, though the rapid movements now tax your weathered body's flexibility.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "QS-L3",
      "name": "Generational Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Generational Defense stance. While in this stance, reduce all damage by 1. When attacked, gain 2 Position and you may change range without spending energy.",
      "drawback": "Each time you change range while in this stance, lose 1 health.",
      "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though each swift movement now takes its toll on your battle-worn body.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}