{
  "styleName": "Rapier & Dagger",
  "styleDescription": "A technical, combo-oriented fighting style based on historical European dueling techniques, featuring precision, quick ripostes, and deadly combinations.",
  "styleType": "Martial",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "This style is primarily inspired by 16th and 17th century Italian rapier traditions, particularly those documented in Salvator Fabris' 'Lo Schermo, overo Scienza d'Arme' (1606) and Ridolfo Capo Ferro's 'Gran Simulacro dell'Arte e dell'Uso della Scherma' (1610). The stance names reflect the Italian numerical guard positions, while the attack terminology draws from historical Italian fencing manuals. The combination of rapier and dagger was common among nobility and duelists of the Renaissance period, offering both offensive precision and defensive versatility.",
  "cards": [
    {
      "id": "RD-01",
      "name": "Prima",
      "subtitle": "First Position",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Prima stance. While in this stance, when you play an attack, gain 1 Precision point.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to make your next attack this turn cost 2 less.",
      "flavorText": "The duelist presents the rapier high with dagger low, controlling the line while preparing for swift attacks at any opening.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-02",
      "name": "Terza",
      "subtitle": "Third Position",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Terza stance. While in this stance, after you receive damage, gain 1 Precision point.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to reduce damage by 2.",
      "flavorText": "A balanced guard with rapier extended, dagger covering the inside line, perfect for parrying and responding with swift counters.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-03",
      "name": "Quinta",
      "subtitle": "Fifth Position",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d8",
      "effect": "Enter the Quinta stance. While in this stance, you may change range for 0 energy once per turn. Gain 1 Precision point when you change range.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 3 Precision points to enter any stance without paying its cost.",
      "flavorText": "The blade is held low with body angled, creating a deceptive distance while preparing for a lightning lunge or sudden retreat.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-04",
      "name": "Stoccata",
      "subtitle": "Lunging Thrust",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend up to 3 Precision points to add that much additional damage.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, if you spend 3 or more Precision points, this attack cannot be reduced by defensive effects.",
      "flavorText": "A perfectly timed thrust extending with the full body, the blade finding its mark with pinpoint accuracy amplified by perfect technique.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-05",
      "name": "Intagliata",
      "subtitle": "Cutting Slash",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 1 damage. If at Close Range, your dagger also deals 1 damage. Gain 1 Precision point.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, change to any stance after this attack resolves, without paying its cost.",
      "flavorText": "A diagonal slash with the rapier followed immediately by a swift dagger cut, the dual weapons working in perfect harmony.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-06",
      "name": "Imbrocatta",
      "subtitle": "Downward Thrust",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 2 damage. If you have 3+ Precision points, draw a card after this attack resolves.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, also force your opponent to exit their current stance.",
      "flavorText": "A descending thrust aimed at the opponent's shoulder or chest, executed with perfect economy of motion to leave no opening for counterattack.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "RD-07",
      "name": "Parata e Risposta",
      "subtitle": "Parry and Riposte",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1, then deal 1 damage. Gain 1 Precision point.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, you may spend 2 Precision points to deal 2 additional damage.",
      "flavorText": "The dagger deflects the incoming strike with delicate precision, immediately followed by a devastating rapier thrust into the opening created.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-08",
      "name": "Girata",
      "subtitle": "Circular Footwork",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 2 Precision points. You may change range. Your next Rapier & Dagger card costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Rapier & Dagger cards this turn, also draw a card.",
      "flavorText": "The duelist steps gracefully to the side with perfect balance, simultaneously repositioning for advantage while preparing the next sequence of attacks.",
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-L1",
      "name": "Ancestral Strike",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend any amount of Precision points to add that much additional damage. For each 2 Precision points spent, draw a card.",
      "drawback": "After this attack resolves, lose all remaining Precision points and skip your next Focus phase.",
      "flavorText": "The perfect strike handed down through generations, combining speed and precision that few can match, though the strain on aging joints is evident in your follow-through.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-L2",
      "name": "Elder's Precision",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain 5 Precision points immediately. Your next two Rapier & Dagger cards each cost 1 less to play this turn.",
      "drawback": "Discard two cards from your hand.",
      "flavorText": "Decades of practice flow through your veins, summoning perfect technique that transcends conscious thought, though accessing such mastery taxes your weathered mind.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "RD-L3",
      "name": "Hereditary Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Hereditary Defense stance. While in this stance, when attacked, gain 2 Precision points and reduce damage by 1. You may spend 3 Precision points to negate an attack completely.",
      "drawback": "At the end of each turn while in this stance, take 1 damage.",
      "flavorText": "The defensive technique refined through your bloodline creates an impenetrable barrier of steel, though maintaining such perfect form strains your battle-worn body.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}