{
  "styleName": "Shortsword & Shield",
  "styleDescription": "A defense-focused fighting style based on historical Roman and Greek shield techniques, featuring powerful counter-attacks, tactical blocking, and defensive maneuvers that punish aggression.",
  "styleType": "Martial",
  "rangePreference": "Close Range",
  "cards": [
    {
      "id": "SS-01",
      "name": "Shield Wall",
      "subtitle": "Impenetrable Defense",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Shield Wall stance. While in this stance, reduce all damage by 2. Gain 1 Guard when you're attacked.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also deal 1 damage to attackers.",
      "flavorText": "The warrior presents their shield with perfect form, creating a nearly impenetrable barrier that deflects blows while setting up devastating counters.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SS-02",
      "name": "Offensive Posture",
      "subtitle": "Shield as Weapon",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Offensive Posture stance. While in this stance, you may spend 2 Guard to increase your next attack's damage by 2.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, immediately gain 2 Guard upon entering this stance.",
      "flavorText": "The fighter leads with the shield's edge rather than its face, using the reinforced rim as a bludgeoning weapon while maintaining some protection.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SS-03",
      "name": "Mobile Defense",
      "subtitle": "Fluid Repositioning",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Mobile Defense stance. While in this stance, after blocking damage with Guard, you may change range as a free action.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also gain 1 Guard when changing range this way.",
      "flavorText": "Rather than absorbing blows directly, the shield bearer deflects them at angles that facilitate immediate repositioning.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SS-04",
      "name": "Shield Bash",
      "subtitle": "Stunning Strike",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 2 damage. If you have 3+ Guard, your opponent cannot play attack cards on their next turn.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also force your opponent to exit their current stance.",
      "flavorText": "A powerful thrust with the shield's face momentarily stuns the opponent, leaving them vulnerable and unable to mount an effective offense.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "SS-05",
      "name": "Swift Riposte",
      "subtitle": "Counter Strike",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Play when attacked. Reduce damage by 2 and deal 2 damage to your attacker. Gain 1 Guard.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, reduce damage by 3 instead.",
      "flavorText": "The shield absorbs the brunt of the attack while the shortsword darts out with lightning speed, exploiting the opponent's momentary vulnerability.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "SS-06",
      "name": "Blade and Barrier",
      "subtitle": "Coordinated Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 3 damage. If you're in a Defensive stance, gain 2 Guard.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also reduce the next damage you would take by 2.",
      "flavorText": "A perfectly coordinated movement where the shield maintains protection even as the sword strikes with precision, a technique requiring years of practice.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "SS-07",
      "name": "Shield Expertise",
      "subtitle": "Technical Defense",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 3 Guard. Your next Shortsword & Shield card costs 1 less energy to play this turn.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also draw a card.",
      "flavorText": "Years of training manifest in subtle adjustments to shield positioning, creating maximum protection with minimal effort and setting up the next maneuver.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SS-08",
      "name": "Defensive Advance",
      "subtitle": "Protected Approach",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Change to Close Range. Gain 2 Guard and reduce all damage by 1 until your next turn.",
      "masterEffect": "If you've played 2+ Shortsword & Shield cards this turn, also draw a card when changing to Close Range.",
      "flavorText": "The warrior closes distance with shield raised, presenting minimal target area while steadily advancing into optimal striking range.",
      "rangeRestriction": "Far Range Only"
    },
    {
      "id": "SS-L1",
      "name": "Ancestral Bulwark",
      "subtitle": "Legacy Technique",
      "type": "Reaction",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Play when attacked. Completely negate the attack and gain Guard equal to the damage that would have been dealt. Deal 2 damage to your attacker.",
      "drawback": "For the rest of this turn and all of your next turn, your attacks deal 1 less damage.",
      "flavorText": "The ultimate defensive technique passed down through your bloodline diverts all incoming force, though executing such perfect form now taxes your offensive capabilities.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "SS-L2",
      "name": "Generational Counter",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal damage equal to your current Guard (minimum 2, maximum 5). This attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, lose all Guard and skip your draw phase next turn.",
      "flavorText": "This devastating attack channels generations of shield expertise into a single perfect strike, though executing the family technique leaves your reserves temporarily depleted.",
      "isLegacy": true,
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "SS-L3",
      "name": "Elder's Aegis",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Enter the Elder's Aegis stance. While in this stance, reduce all damage by 2 and gain 2 Guard when attacked. When you spend Guard, it's twice as effective.",
      "drawback": "While in this stance, you can only play one card per turn, and you cannot change range.",
      "flavorText": "The ultimate defensive posture passed down through your family creates near invulnerability, though maintaining such perfect form now severely limits your mobility and options.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}