{
  "styleName": "Spear",
  "styleDescription": "A zone control fighting style based on historical spear techniques, featuring reach advantage, range manipulation, and area control tactics.",
  "styleType": "Martial",
  "rangePreference": "Flexible Range",
  "historicalInspiration": "This style draws primarily from Japanese sōjutsu (yari/spear techniques) of feudal Japan, with influences from European pike formations and Chinese qiangfa (spear methods). The stances are based on kamae positions from the Tenshin Shōden Katori Shintō-ryū and other traditional Japanese martial schools that included spear combat.",
  "cards": [
    {
      "id": "SP-01",
      "name": "Hoko-no-kamae",
      "subtitle": "Spear Guard",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Hoko-no-kamae stance. While in this stance, your attacks deal +1 damage at Far Range.",
      "masterEffect": "If you've played 2+ Spear cards this turn, also gain 1 Reach Advantage when you deal damage at Far Range.",
      "flavorText": "The warrior extends the spear with perfect balance, creating a deadly zone that opponents must navigate with extreme caution.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-02",
      "name": "Gedan-gamae",
      "subtitle": "Low Guard",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 1,
      "focusDie": "d6",
      "effect": "Enter the Gedan-gamae stance. While in this stance, reduce damage from Close Range attacks by 1. Gain 1 Reach Advantage when changing to Far Range.",
      "masterEffect": "If you've played 2+ Spear cards this turn, after reducing damage, you may change range.",
      "flavorText": "The spear is held low and angled, creating a defensive barrier while preparing to extend distance with a swift backward step.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-03",
      "name": "Chudan-gamae",
      "subtitle": "Middle Guard",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Chudan-gamae stance. While in this stance, you may spend 2 Reach Advantage to change range and draw a card.",
      "masterEffect": "If you've played 2+ Spear cards this turn, also reduce the next attack's damage by 1 after changing range.",
      "flavorText": "The spear is held at center height with perfect balance, allowing swift transitions between advance and retreat with minimal telegraph.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-04",
      "name": "Tsuki",
      "subtitle": "Thrusting Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. If at Far Range, deal +1 damage and gain 1 Reach Advantage.",
      "masterEffect": "If you've played 2+ Spear cards this turn, you may spend 2 Reach Advantage to make this attack unreducible by defensive effects.",
      "flavorText": "A lightning-fast thrust with perfect extension, the spear tip finding its mark before the opponent can react to the subtle movement.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-05",
      "name": "Harai",
      "subtitle": "Sweeping Technique",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 1 damage. Change to your preferred range and gain 2 Reach Advantage.",
      "masterEffect": "If you've played 2+ Spear cards this turn, also force your opponent to exit their current stance.",
      "flavorText": "The spear sweeps in a wide arc, simultaneously creating distance while disrupting the opponent's position and balance.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-06",
      "name": "Kaeshi",
      "subtitle": "Redirecting Thrust",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 2 damage. You may spend 2 Reach Advantage to change range after this attack resolves.",
      "masterEffect": "If you've played 2+ Spear cards this turn, if you change to Far Range, this attack deals +2 damage.",
      "flavorText": "A deceptive thrust that begins as one attack before smoothly transitioning into another, allowing perfect distance control throughout the sequence.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-07",
      "name": "Sune-kake",
      "subtitle": "Shaft Block",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and gain 1 Reach Advantage. If at Far Range, also change to Close Range.",
      "masterEffect": "If you've played 2+ Spear cards this turn, also deal 1 damage to your opponent.",
      "flavorText": "The spear shaft intercepts the incoming attack, allowing the warrior to slide forward along the weapon to close distance with perfect timing.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-08",
      "name": "Ashi-sabaki",
      "subtitle": "Footwork Mastery",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Gain 2 Reach Advantage. Change range if desired. Your next Spear card costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Spear cards this turn, also draw a card if you're at your preferred range.",
      "flavorText": "The spear wielder shifts position with masterful footwork, controlling the engagement distance with subtle movements that create perfect striking opportunities.",
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-L1",
      "name": "Ancestral Thrust",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. If at Far Range, deal +2 damage. You may spend any amount of Reach Advantage to add that much additional damage. This attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, change to Close Range and take 1 damage.",
      "flavorText": "The perfect thrust handed down through generations, combining power and precision that few can match, though the extension leaves your aging body momentarily vulnerable.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-L2",
      "name": "Elder's Zone Control",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Gain 4 Reach Advantage immediately. Change to Far Range. All your opponents' attacks cost +1 energy until your next turn.",
      "drawback": "You cannot change stance until the end of your next turn.",
      "flavorText": "Decades of practice allow perfect zone control that transcends conscious thought, though maintaining such mastery taxes your weathered body's flexibility.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "SP-L3",
      "name": "Generational Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Generational Defense stance. While in this stance, when attacked, gain 2 Reach Advantage and change to your preferred range. Reduce damage by 1 at Far Range.",
      "drawback": "Each time you change range while in this stance, discard a card.",
      "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though each movement now requires greater sacrifice as you age.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}