{
  "styleName": "Thrown Weapons",
  "styleDescription": "A tactical ranged fighting style based on historical throwing techniques, featuring resource management, strategic positioning, and sustained pressure from multiple projectiles.",
  "styleType": "Martial",
  "rangePreference": "Far Range",
  "historicalInspiration": "This style draws from diverse historical throwing weapon traditions across cultures, including Roman plumbata (weighted darts), Norse casting spears, Japanese shuriken-jutsu, Native American tomahawk techniques, and African throwing knives. The arsenal management system reflects the historical reality of weapon retrieval and conservation in combat. Many ancient and medieval warriors carried multiple throwing weapons as part of their equipment, using them strategically before closing to melee range, or maintaining distance with a constant barrage of projectiles.",
  "cards": [
    {
      "id": "TW-01",
      "name": "Barrage Position",
      "subtitle": "Volley Stance",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Barrage Position stance. While in this stance, add 1 to your Arsenal when you deal damage with a Thrown Weapons attack.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, your attacks cost -1 energy for each 3 Arsenal you have.",
      "flavorText": "The thrower arranges multiple weapons for quick access, creating a deadly zone where each throw is immediately followed by another.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-02",
      "name": "Defensive Array",
      "subtitle": "Counter Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Defensive Array stance. While in this stance, when attacked, you may spend 2 Arsenal to reduce damage by 2.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also deal 1 damage to your opponent when you reduce damage this way.",
      "flavorText": "Weapons held at the ready between fingers, allowing for instant defensive throws to intercept incoming attacks before they land.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-03",
      "name": "Mobile Thrower",
      "subtitle": "Skirmisher Stance",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 1,
      "focusDie": "d8",
      "effect": "Enter the Mobile Thrower stance. While in this stance, you may change to Far Range for 0 energy once per turn and add 1 to your Arsenal when you do.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also draw a card when you change to Far Range.",
      "flavorText": "Light on their feet, these fighters excel at maintaining optimal distance, retrieving weapons as they move with fluid grace.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-04",
      "name": "Plumbata Volley",
      "subtitle": "Weighted Darts",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. If at Far Range, deal +1 damage. Add 1 to your Arsenal.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, you may spend 3 Arsenal to have this attack deal double damage.",
      "flavorText": "A flurry of weighted darts hurled in rapid succession, their lead weights giving them devastating armor-piercing power.",
      "rangeRestriction": "Far Range Only"
    },
    {
      "id": "TW-05",
      "name": "Chakram Throw",
      "subtitle": "Circular Blade",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Deal 1 damage. You may spend 2 Arsenal to have this attack strike again for 1 additional damage.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, you may spend 2 more Arsenal to strike a third time.",
      "flavorText": "The circular throwing blade curves through the air on a controlled path, potentially striking multiple targets before returning to the thrower's hand.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-06",
      "name": "Francisca Axe",
      "subtitle": "Heavy Throwing Axe",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d8",
      "effect": "Deal 3 damage. If you have 4+ Arsenal, this attack cannot be reduced by defensive effects.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also force your opponent to exit their current stance.",
      "flavorText": "The heavy throwing axe spins with devastating force, its weighted head designed to crush shields and armor alike.",
      "rangeRestriction": "Far Range Only"
    },
    {
      "id": "TW-07",
      "name": "Intercept Throw",
      "subtitle": "Defensive Counter",
      "type": "Reaction",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Play when your opponent plays an attack. Reduce that attack's damage by 1 and deal 1 damage to your opponent. Add 1 to your Arsenal.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also change to Far Range if desired.",
      "flavorText": "A perfectly timed throw meets the opponent's attack mid-flight, deflecting their weapon while continuing onward to strike true.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-08",
      "name": "Gather Arsenal",
      "subtitle": "Resupply",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Add 3 to your Arsenal. Your next Thrown Weapons attack costs 1 less to play this turn.",
      "masterEffect": "If you've played 2+ Thrown Weapons cards this turn, also draw a card for every 4 Arsenal you have.",
      "flavorText": "The fighter quickly retrieves spent weapons or produces hidden ones from various sheaths and pouches, preparing for the next barrage.",
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-L1",
      "name": "Ancestral Barrage",
      "subtitle": "Legacy Attack",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 2 damage. You may spend any amount of Arsenal to add that much additional damage. If at Far Range, this attack cannot be reduced by defensive effects.",
      "drawback": "After this attack resolves, remove half your Arsenal (rounded up) and take 1 damage.",
      "flavorText": "The culmination of generations of throwing mastery, a devastatingly precise volley that strains aging joints with each perfect throw.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-L2",
      "name": "Elder's Preparation",
      "subtitle": "Legacy Technique",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Add 6 to your Arsenal. Draw 2 cards. Your next Thrown Weapons attack costs 2 less energy to play.",
      "drawback": "Skip your Draw phase next turn and discard a card from your hand.",
      "flavorText": "Decades of combat experience allow for masterful preparation, though summoning such focus now takes a heavy toll on your weathered mind.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    },
    {
      "id": "TW-L3",
      "name": "Generational Defense",
      "subtitle": "Legacy Stance",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Generational Defense stance. While in this stance, when attacked, you may spend 2 Arsenal to negate the attack completely. If at Far Range, add 2 to your Arsenal at the start of your turn.",
      "drawback": "While in this stance, you cannot have more than 8 Arsenal at any time.",
      "flavorText": "The defensive technique refined through your bloodline creates an impenetrable zone of control, though your aging body limits the number of weapons you can ready at once.",
      "isLegacy": true,
      "rangeRestriction": "Any"
    }
  ]
}