{
  "styleName": "Blood Magic",
  "styleDescription": "A dark, sacrifice-based fighting style focusing on converting life force into power. Features risk-reward mechanics, health manipulation, and devastating effects paid for with the caster's vitality.",
  "styleType": "Magical",
  "rangePreference": "Flexible Range",
  "cards": [
    {
      "id": "BM-01",
      "name": "Blood Pact",
      "subtitle": "Dark Covenant",
      "type": "Stance",
      "stanceType": "Aggressive",
      "cost": 1,
      "focusDie": "d10",
      "effect": "Enter the Blood Pact stance. While in this stance, you may pay 1 health instead of 1 energy when playing cards. When you deal damage, gain 1 Vitality.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, immediately gain 2 Vitality upon entering this stance.",
      "flavorText": "The mage slices their palm, dark energy pulsing with each heartbeat as their wounds fuel devastating attacks.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-02",
      "name": "Sanguine Shield",
      "subtitle": "Crimson Barrier",
      "type": "Stance",
      "stanceType": "Defensive",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Enter the Sanguine Shield stance. While in this stance, you may spend 2 Vitality to prevent 3 damage from any source.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, also deal 1 damage to your opponent when you prevent damage this way.",
      "flavorText": "Blood drawn from self-inflicted wounds solidifies in mid-air, forming a crimson barrier that absorbs enemy strikes.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-03",
      "name": "Bloodmist Form",
      "subtitle": "Vaporous Escape",
      "type": "Stance",
      "stanceType": "Evasive",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Enter the Bloodmist Form stance. While in this stance, when targeted by an attack, you may lose 1 health to change range immediately.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, also gain 2 Vitality when changing range this way.",
      "flavorText": "The practitioner's body liquefies into a cloud of blood droplets, allowing them to flow between attackers and reassemble at a safer position.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-04",
      "name": "Crimson Lance",
      "subtitle": "Vitality Spear",
      "type": "Attack",
      "cost": 2,
      "focusDie": "d8",
      "effect": "Deal 2 damage. You may lose up to 3 additional health to add that much damage to this attack.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, gain Vitality equal to half the extra damage dealt (rounded up).",
      "flavorText": "The mage violently expels their own blood, which hardens into a deadly projectile—the more blood sacrificed, the larger and more devastating the weapon.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-05",
      "name": "Blood Tithe",
      "subtitle": "Life for Power",
      "type": "Technique",
      "cost": 1,
      "focusDie": "d4",
      "effect": "Lose 2 health to gain 3 Vitality. Draw a card.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, lose only 1 health instead.",
      "flavorText": "With practiced precision, the mage opens their veins and channels the escaping lifeblood into a swirling reservoir of power available for immediate use.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-06",
      "name": "Hemomancy",
      "subtitle": "Blood Divination",
      "type": "Technique",
      "cost": 2,
      "focusDie": "d6",
      "effect": "Spend any amount of Vitality. Look at the top X cards of your deck, where X is the amount spent. Put one in your hand and the rest on the bottom of your deck in any order.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, put two cards in your hand instead of one.",
      "flavorText": "Blood splashed onto the ground forms intricate patterns that reveal nearby enemies, upcoming attacks, and optimal counter-maneuvers to the trained eye.",
      "rangeRestriction": "Any"
    },
    {
      "id": "BM-07",
      "name": "Life Siphon",
      "subtitle": "Vampiric Strike",
      "type": "Attack",
      "cost": 3,
      "focusDie": "d10",
      "effect": "Deal 3 damage. Heal health equal to the damage dealt.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, also gain 2 Vitality.",
      "flavorText": "The mage's attack opens wounds that connect to their own body, creating a conduit that transfers the enemy's vitality directly into their depleted reserves.",
      "rangeRestriction": "Close Range Only"
    },
    {
      "id": "BM-08",
      "name": "Blood Gambit",
      "subtitle": "Fatal Wager",
      "type": "Reaction",
      "cost": 0,
      "focusDie": "d12",
      "effect": "Play when attacked. Lose 2 health and roll your stance's focus die. If the result is 7+, negate the attack completely. If the result is less than 7, take full damage from the attack.",
      "masterEffect": "If you've played 2+ Blood Magic cards this turn, roll twice and choose the better result.",
      "flavorText": "Facing certain death, the mage slashes their own arteries in a desperate gamble, using the sudden rush of power to potentially repel the attack completely.",
      "rangeRestriction": "Any"
    }
  ]
}
